questions[questions.length] = [
	{
		"ID": "question403149697",
		"题目": "在_________范围内的端口号被称为“熟知端口”并限制使用。这就意味着这些端口号是为常用的应用层协议,如FTP、HTTP等保留的。",
		"选项": [
			"A. 0~511",
			"B. 0~255",
			"C. 0~1023",
			"D. 0~127"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149698",
		"题目": "在整个因特网上,使用_________可以唯一标识一个特定的应用进程。",
		"选项": [
			"A. 应用程序的ID号",
			"B. 物理地址+端口号",
			"C. 端口号",
			"D. IP地址+传输层协议ID+传输层端口号"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149699",
		"题目": "DNS服务所依赖的协议是_________",
		"选项": [
			"A. SNMP",
			"B. TCP",
			"C. UDP",
			"D. ICMP"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149700",
		"题目": "标识主机上的进程,需要的信息包括__________",
		"选项": [
			"A. IP地址、MAC地址",
			"B. IP地址、传输层协议、传输层端口号",
			"C. MAC地址、端口编号",
			"D. 域名地址、MAC地址"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149701",
		"题目": "属于应用层协议的是_________",
		"选项": [
			"A. TCP、IP",
			"B. ICMP、CSMA/CD",
			"C. ARP、UDP",
			"D. DNS、HTTP"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149702",
		"题目": "使用浏览器访问某个大学网站主页时,不会使用到的网络协议是________",
		"选项": [
			"A. ARP",
			"B. TCP",
			"C. ICMP",
			"D. HTTP"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149703",
		"题目": "下述有关DNS描述中,不正确的是_________",
		"选项": [
			"A. 当客户请求域名服务器转换名字时,服务器首先按标准过程检查它是否被授权管理该名字",
			"B. 域名服务器向客户报告缓存中有关名字与地址的绑定(binding)信息",
			"C. 因特网不允许各个单位将本单位的域名划分为若干个域名服务器管辖区(zone)",
			"D. 每个域名服务器都维护一个高速缓存,存放最近用过的名字以及从何处获得名字映射信息的记录"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149704",
		"题目": "Web使用_________协议进行信息传输。",
		"选项": [
			"A. DNS",
			"B. HTTP",
			"C. HTML",
			"D. WWW"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149705",
		"题目": "下述有关www描述中,不正确的是_________",
		"选项": [
			"A. WWW工作过程可简要描述为:浏览器与服务器之间建立TCP连接;浏览器发出HTTP请求报文;服务器给出HTTP响应报文;断开TCP连接",
			"B. 浏览器是运行于计算机上的万维网客户端程序;万维网文档所驻留的计算机则运行服务器程序。",
			"C. HTTP 是面向事务的应用层协议,它直接使用IP协议传送",
			"D. 一个超文本由多个信息源链接组成,利用一个链接可使用户找到因特网上的另一个文档。"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149706",
		"题目": "在Internet域名体系中,域的下面可以划分子域,各级域名用圆点分开,按照_________",
		"选项": [
			"A. 从右到左越来越小的方式分4层排列",
			"B. 从左到右越来越小的方式分4层排列",
			"C. 从右到左越来越小的方式分多层排列",
			"D. 从左到右越来越小的方式分多层排列"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149707",
		"题目": "超文本的含义是_________",
		"选项": [
			"A. 该文本中含有图像",
			"B. 该文本中含有链接到其他文本的链接点",
			"C. 该文本中含有二进制数",
			"D. 该文本中含有声音"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149708",
		"题目": "当一台计算机从Web服务器下载网页文件时,在该服务器上对数据进行封装的五个转换步骤是_________",
		"选项": [
			"A. 比特,数据帧,数据报,报文段,消息",
			"B. 数据段,数据包,数据帧,比特,消息",
			"C. 消息,报文段,数据报,数据帧,比特",
			"D. 消息,数据包,数据段,数据帧,比特"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149709",
		"题目": "DNS服务主要解决的问题是_________",
		"选项": [
			"A. 域名到硬件地址的映射",
			"B. 域名到端口号的映射",
			"C. 域名到IP地址的映射",
			"D. 域名到网页的映射"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149710",
		"题目": "域名与_________具有一一对应的关系。",
		"选项": [
			"A. MAC地址",
			"B. 主机",
			"C. IP地址",
			"D. 以上都不是"
		],
		"我的答案": " D",
		"标准答案": " D"
	}
]