questions[questions.length] = [
	{
		"ID": "question403149711",
		"题目": "下列选项中,不属于计算机网络物理层的特性是_________",
		"选项": [
			"A. 机械特性",
			"B. 传输特性",
			"C. 电气特性",
			"D. 功能特性"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149712",
		"题目": "信息传输速率的单位是_________",
		"选项": [
			"A. 吉",
			"B. 兆",
			"C. 波特",
			"D. 比特/秒"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149713",
		"题目": "码元传输速率的单位是_________",
		"选项": [
			"A. 吉",
			"B. 兆",
			"C. 比特/秒",
			"D. 波特"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149714",
		"题目": "承载信息量的基本信号单位是_________",
		"选项": [
			"A. 数据传输速率",
			"B. 码元",
			"C. 比特",
			"D. 误码率"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149715",
		"题目": "通信系统必须具备的三个基本要素是_________",
		"选项": [
			"A. 信源、通信媒体、信宿",
			"B. 终端、电缆、计算机",
			"C. 信号发生器、通信线路、信号接收设备",
			"D. 终端、通信设施、接收设备"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149716",
		"题目": "以下陈述中错误的说法是_________",
		"选项": [
			"A. 调制速率又称为波特率,即码元传输的速率",
			"B. 调制速率,即每秒钟载波调制状态改变的数值,其单位是1/s(称为波特,Baud)",
			"C. 数据传输速率,即每秒钟传输的二进制比特数,单位bit/sec,又称为比特率",
			"D. 在计算二进制数据通信速率时,1K = 1024"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149717",
		"题目": "采用全双工通信方式,数据_________",
		"选项": [
			"A. 只能在一个方向上传输",
			"B. 可以在两个方向上同时传输",
			"C. 可以在两个方向上传输,但不能同时进行",
			"D. 使用两条线传输"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149718",
		"题目": "在同一信道上不同时刻,可进行双向数据传送的通信方式是_________",
		"选项": [
			"A. 单工",
			"B. 半双工",
			"C. 双工",
			"D. 串行"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149719",
		"题目": "某网络的物理层规定,信号的电平用+10~+15V表示二进制0,用-10~-15V表示二进制1,电线长度限于15m以内,这体现了物理层接口的_________",
		"选项": [
			"A. 机械特性",
			"B. 电气特性",
			"C. 规程特性",
			"D. 功能特性"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149720",
		"题目": "中继器的作用是________",
		"选项": [
			"A. 根据输入端的信号重新生成原始信号再通过输出端传送出去",
			"B. 将输入端的信号滤波再通过输出端传送出去",
			"C. 存储转发数据帧",
			"D. 将输入端的信号放大再通过输出端传送出去"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149721",
		"题目": "在理想状态的信道中,数据从发送端到接收端是无差错的,但在实际应用中,数据的传输会产生差错,下面不是由于物理介质影响差错的因素是________",
		"选项": [
			"A. 相邻线路之间的串线干扰,以及闪电,电磁的干扰等",
			"B. 电气信号在线路上产生反射造成的回波效应",
			"C. 信号在物理线路上随机产生的信号幅度,频率,相位的畸形和衰减",
			"D. 数据的压缩率太高,造成在传输中出现的错误无法克服"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149722",
		"题目": "电缆屏蔽的好处是________",
		"选项": [
			"A. 减少电缆的阻抗",
			"B. 减少物理损坏",
			"C. 减少信号衰减",
			"D. 减少电磁干扰辐射"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149723",
		"题目": "在两台设备之间实现通信,必须具备_________",
		"选项": [
			"A. 网卡、交换机、路由器",
			"B. 交换机、路由器、集线器",
			"C. 网卡、交换机、计算机",
			"D. 网卡、传输介质、协议"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149724",
		"题目": "网络适配器的主要功能不包括_________",
		"选项": [
			"A. 缓存数据",
			"B. 流量控制",
			"C. 进行串行/并行转换",
			"D. 实现数据链路层协议"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149725",
		"题目": "数据链路层的数据封装与解封是由_________完成的",
		"选项": [
			"A. 网卡",
			"B. 路由器",
			"C. CPU",
			"D. 集线器"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149726",
		"题目": "数据链路层的功能,不包括_________",
		"选项": [
			"A. 链路管理",
			"B. 帧定界",
			"C. 流量控制",
			"D. 差错控制"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149727",
		"题目": "帧定界的方法可分为_________",
		"选项": [
			"A. 字符计数法、起止标记法",
			"B. 0比特插入法、字符插入法",
			"C. 调制、解调",
			"D. CRC、奇偶校验"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149728",
		"题目": "下列属于奇偶校验码的特征是_________",
		"选项": [
			"A. 能检查出奇数个比特错误",
			"B. 能检查出偶数个比特错误",
			"C. 只能查出一个比特的错误",
			"D. 能查出任意数量比特的错误"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149729",
		"题目": "下列属于CRC的特征是_________",
		"选项": [
			"A. 能检查出奇数个比特错误",
			"B. 能查出一定数量比特的错误",
			"C. 只能查出一个比特的错误",
			"D. 能检查出偶数个比特错误"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149730",
		"题目": "使用HDLC数字链路传送比特串11100111111111111001,经过零比特填充的比特串为_________",
		"选项": [
			"A. 11100111110111110110001",
			"B. 11100111110111110110010",
			"C. 1110011111011111110010",
			"D. 1110011111011111011001"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149731",
		"题目": "下面关于循环冗余校验的说法中错误的是_________",
		"选项": [
			"A. 有一些特殊的多项式,因其特性良好而成为CRC的国际标准",
			"B. CRC校验可以通过硬件实现",
			"C. 带r个校验位的多项式编码可以检测到所有长度小于或等于r的突发性错误",
			"D. 通信双方可以无需商定就直接使用多项式编码"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149732",
		"题目": "采用CRC方法传输比特流1010001101,生成多项式为x^5+x^4+x^2+1,则待传输的比特串是_________",
		"选项": [
			"A. 101000110101111",
			"B. 101000110101100",
			"C. 101000110101110",
			"D. 101000110111110"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149733",
		"题目": "不属于自动请求重传的策略是_________",
		"选项": [
			"A. 选择重传机制",
			"B. 停止等待ARQ协议",
			"C. 后退N机制",
			"D. CSMA"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149734",
		"题目": "______是源机器向目的机器发出独立的帧,而目的机器对收到的帧不做确认",
		"选项": [
			"A. 面向确认的服务",
			"B. 面向连接的服务",
			"C. 无确认,面向连接服务",
			"D. 无确认,无连接服务"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149735",
		"题目": "透明传输是数据链路层的基本功能,所谓透明性是指_________",
		"选项": [
			"A. 传输数据的方式透明",
			"B. 传输的数据内容、格式及编码无限制",
			"C. 传输的数据内容、格式及编码有限",
			"D. 传输数据的方向透明"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149736",
		"题目": "在可靠传输通信协议中,回复报文ACK表示_________",
		"选项": [
			"A. 拆除建立链路",
			"B. 正确接收发送方报文的确认",
			"C. 未正确接收发送方报文的响应",
			"D. 请求远程站的响应"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149737",
		"题目": "数据链路层实现可靠传输的方法不包括_________",
		"选项": [
			"A. 帧定界",
			"B. 超时重传",
			"C. 确认",
			"D. 帧序号"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149738",
		"题目": "数据链路层解决可靠传输及流量控制问题的基本方法包括_________",
		"选项": [
			"A. 超时、滑动窗口协议、选择重传",
			"B. 确认、重传、停止等待协议",
			"C. 确认、定时器超时、帧序号",
			"D. 确认、重传、帧序号"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149739",
		"题目": "接收端发现有差错时,设法通知发送端重发,直到收到正确的分组为止,这种差错控制方法称为_________",
		"选项": [
			"A. 自动请求重传",
			"B. 混合差错控制",
			"C. 前向纠错",
			"D. 冗余校验"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149740",
		"题目": "在停止等待协议算法中,使用帧序号的目的是_________",
		"选项": [
			"A. 处理重复帧",
			"B. 处理确认帧的丢失",
			"C. 处理数据帧的丢失",
			"D. 处理差错"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149741",
		"题目": "在停止等待协议中,如果帧出现丢失,发送端不会永远的等待下去,解决这种死锁问题的方法是_________",
		"选项": [
			"A. ACK机制",
			"B. 超时机制",
			"C. 差错校验",
			"D. 帧编号"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149742",
		"题目": "为实现可靠传输,当数据帧丢失时,系统将重传数据帧,当ACK丢失时,系统会_________",
		"选项": [
			"A. 重传ACK",
			"B. 重传数据帧",
			"C. 重新建立连接",
			"D. 调整窗口大小"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149743",
		"题目": "在以下滑动窗口概念的描述中,错误的是_________",
		"选项": [
			"A. 连续工作ARQ可以分为回退N帧和选择重传",
			"B. 由于ARQ机制中多帧、连续工作等需求,引入了滑动窗口的概念",
			"C. 帧序号长度为三位,ARQ能够使用的最大窗口范围为16",
			"D. 发送窗口W_s表示在没有接收到确认的情况下,发送方最多可以连续发送的数据量"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149744",
		"题目": "以下关于连续工作ARQ方式的描述中,错误的是_________",
		"选项": [
			"A. 停止等待方式的优点是协议简单,但是协议效率低",
			"B. 回退N帧方式虽然重发的帧可能多一些,但是它的效率高于选择重传方式",
			"C. 滑动窗口的ARQ提升了链路的传输效率,同时也付出了窗口缓存的开销",
			"D. 发送方在选择重传ARQ方式下只需要发送出错的帧"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149745",
		"题目": "从滑动窗口的观点来看,当发送窗口大于1,接收窗口等于1时,相当于ARQ的_________方式。",
		"选项": [
			"A. 连续ARQ",
			"B. 停止等待协议",
			"C. 后退N帧ARQ",
			"D. 选择重传ARQ"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149746",
		"题目": "数据链路层采用了后退N帧(GBN)协议,发送方已经发送了编号为0-7的数据帧。当发送方计时器超时时,若发送方只收到了0、2、3、4号帧的确认,则发送方需要重新发送的帧数是_________",
		"选项": [
			"A. 4",
			"B. 1",
			"C. 2",
			"D. 3"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149747",
		"题目": "数据链路层采用选择重传(Selective ACK)协议传输数据,发送方已经发送了0-3号数据帧,现已收到1号帧的ACK确认,而0、2号帧依次超时,则此时需要重传的帧数是_________",
		"选项": [
			"A. 3",
			"B. 1",
			"C. 2",
			"D. 4"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149748",
		"题目": "两台主机之间的数据链路层采用后退N帧协议传输数据,数据传输速率为16kbps,单向传播时延为270ms,数据帧长度范围是128-512字节,接收方总是以与数据帧等长的帧进行确认,为使信道利用率达到最高,帧序列的比特数至少为_________",
		"选项": [
			"A. 3",
			"B. 5",
			"C. 4",
			"D. 2"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149749",
		"题目": "以下属于局域网研究范畴的是(   )",
		"选项": [
			"A. 通信方式、同步方式和拓扑结构",
			"B. 传输媒质、差错检错方法和拥塞控制",
			"C. 传输媒质、拓扑结构和媒质访问控制方法",
			"D. 数据编码技术、媒质访问控制和数据交换技术"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149750",
		"题目": "IEEE802将数据链路层划分为两个子层,上子层是________,下子层是________。",
		"选项": [
			"A. MAC,LLC",
			"B. PDU,HDLC",
			"C. HDLC,PDU",
			"D. LLC,MAC"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149751",
		"题目": "解决媒质接入控制问题的前提是_________:",
		"选项": [
			"A. 资源预留",
			"B. 滑动窗口协议",
			"C. 碰撞检测",
			"D. 主机物理标识"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149752",
		"题目": "对于术语 10base-T,base表示_________",
		"选项": [
			"A. 基础设施",
			"B. 最基本的传输速率",
			"C. 连接线上的信号是基带信号",
			"D. 连接线上的信号是数字信号"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149753",
		"题目": "关于100BASE-T的描述中错误的是_________",
		"选项": [
			"A. 数据传输速率为100Mbit/S",
			"B. 支持共享式和交换式两种组网方式",
			"C. 采用5类双绞线介质,其最大传输距离为185M",
			"D. 信号类型为基带信号"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149754",
		"题目": "以太网的优点不包括_________",
		"选项": [
			"A. 施工和维护方便",
			"B. 实时传输性能好",
			"C. 成本低",
			"D. 可扩展性好"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149755",
		"题目": "以下对于MAC地址,描述正确的是_________",
		"选项": [
			"A. 48位,存放在网卡上",
			"B. 32位,存放在内存中",
			"C. 32位,存放在硬盘上",
			"D. 48位,存放在操作系统上"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149756",
		"题目": "以下关于以太网的说法中,正确的是_________",
		"选项": [
			"A. 以太网只包括物理层和数据链路层",
			"B. 以太网必须采用CSMA/CD协议",
			"C. 以太网提供有确认的无连接的服务",
			"D. 以太网的物理拓扑总是总线型的结构"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149757",
		"题目": "下面关于传统共享式以太网的描述哪个是正确的?_________",
		"选项": [
			"A. 两个节点相互通信时,第3个节点不检测总线上的信号",
			"B. 数据是以广播方式发送的",
			"C. 网络中有一个控制中心,用于控制所有节点的发送和接收",
			"D. 所有节点可以同时发送和接受数据"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149758",
		"题目": "CSMA/CD协议不涉及的设计元素包括_________",
		"选项": [
			"A. 多点接入",
			"B. 碰撞检测",
			"C. 冲突避免",
			"D. 载波侦听"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149759",
		"题目": "早期设计的传统以太网采用的拓扑结构是_________",
		"选项": [
			"A. 星型",
			"B. 树型",
			"C. 总线型",
			"D. 全连接"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149760",
		"题目": "长2km、数据传输率为10Mbps的传统总线型以太网,信号传播速度为200m/μs,试计算1000比特的帧从发送开始到接收结束的最大时间是多少?_________",
		"选项": [
			"A. 90μs",
			"B. 100μs",
			"C. 110μs",
			"D. 120μs"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149761",
		"题目": "在一个采用CSMA/CD协议的网络中,传输介质是一个完整的电缆,传输速率是1Gbps,电缆中的信号传播速度是200000km/s。若最小数据帧长度减少800bit,则最远的两个站点之间的距离至少要_________",
		"选项": [
			"A. 减少160m",
			"B. 增加160m",
			"C. 减少80m",
			"D. 增加80m"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149762",
		"题目": "在共享式以太网中,冲突_________",
		"选项": [
			"A. 是一种正常现象",
			"B. 是由于网络管理员的失误造成的",
			"C. 是一种不正常现象",
			"D. 是由于介质访问控制方法的错误使用造成的"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149763",
		"题目": "以太网媒体访问控制技术CSMA/CD的机制是_________",
		"选项": [
			"A. 预约带宽",
			"B. 循环使用带宽",
			"C. 按优先级分配带宽",
			"D. 争用带宽"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149764",
		"题目": "使用CSMA/CD协议的站点在发送帧的过程中发生冲突时,它将________。",
		"选项": [
			"A. 立即停止发送当前帧,进入监听状态",
			"B. 立即停止发送当前帧,改发强化冲突信号,然后进行退避处理",
			"C. 不做处理,继续将当前帧发完,冲突造成的错误交由高层处理",
			"D. 不做处理,继续将当前帧发完,然后经差错检测后重发"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149765",
		"题目": "以太网提供的是_________",
		"选项": [
			"A. 无连接、不可靠服务",
			"B. 无连接、可靠服务",
			"C. 连接、可靠服务",
			"D. 连接、不可靠服务"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149766",
		"题目": "以下关于CSMA/CD发送流程的描述中,错误的是_________",
		"选项": [
			"A. 先听后发",
			"B. 延迟重发",
			"C. 冲突加强",
			"D. 边发边听"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149767",
		"题目": "以下关于CSMA/CD\"冲突窗口\"的描述中,错误的是_________",
		"选项": [
			"A. 主机在发送一个帧前64B没有发现冲突,仍然不能表明它已经成功获得总线发送权",
			"B. 64B是以太网的最小帧长度",
			"C. 冲突窗口的51.2us可以发送64B数据",
			"D. 冲突窗口长度为51.2us"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149768",
		"题目": "共享式Ethernet采用的媒体访问控制方式是_________",
		"选项": [
			"A. 令牌总线",
			"B. 令牌环",
			"C. CSMA/CD",
			"D. CSMA/CA"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149769",
		"题目": "在以太网中,MAC帧中的源地址域的内容是______。",
		"选项": [
			"A. 源主机的服务访问控制点地址",
			"B. 目的主机的服务访问控制点地址",
			"C. 目地站点的物理地址",
			"D. 发送站点的物理地址"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149770",
		"题目": "对于基带CSMA/CD而言,为了确保发送站点在传输时能检测到可能存在的冲突,数据帧的传输时延至少要等于信号传播时延的_________",
		"选项": [
			"A. 3倍",
			"B. 1倍",
			"C. 1/2倍",
			"D. 2倍"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149771",
		"题目": "以太网的碰撞窗口或争用期为_________",
		"选项": [
			"A. 往返传播时延",
			"B. 传播时延",
			"C. 处理时延",
			"D. 发送时延"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149772",
		"题目": "在802.11无线局域网中,应对隐藏终端、暴露终端问题的方法是_________",
		"选项": [
			"A. 碰撞检测",
			"B. 载波监听",
			"C. 多径传播",
			"D. RTS/CTS 机制"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149773",
		"题目": "在以下针对802.11无线局域网工作原理中,描述错误的是_________",
		"选项": [
			"A. 在发送数据帧之前交换RTS/CTS等控制信息",
			"B. 如果发送方收到针对自己的 CTS, 则可以发送数据",
			"C. 非收发节点收到 CTS, 则认定信道在指定长度数据帧发送期间处于繁忙状态",
			"D. 发送方预约信道失败后,无需等待,可立刻重发RTS帧再次预约信道"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149774",
		"题目": "截断二进制指数类型退避算法解决了_________",
		"选项": [
			"A. 站点检测到冲突后延迟发送的时间计算的问题",
			"B. 站点是如何对冲突进行检测",
			"C. 站点检测到冲突后多点接入的方法",
			"D. 站点如何避免冲突"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149775",
		"题目": "无线局域网不使用CSMA/CD,而使用CSMA/CA的原因是_________",
		"选项": [
			"A. 无线通信的覆盖范围小,不进行冲突检测不影响正确性",
			"B. 无线通信信号有效通信范围内,实施冲突避免更易于实现",
			"C. 无线局域网采用了二进制指数退避的冲突恢复策略",
			"D. 无线介质传输特征复杂,存在隐藏终端、暴露终端等问题"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149776",
		"题目": "关于无线局域网,叙述错误的是_________",
		"选项": [
			"A. 有固定基础设施的无线局域网,使用无线接入点(AP)作为基础设施",
			"B. 无线局域网可分为两大类,即有固定基础设施的和无固定基础设施的",
			"C. 有固定基础设施的无线局域网的MAC层使用CSMA/CD协议",
			"D. 无固定基础设施的无线局域网又叫做自组织(AD HOC)网络"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149777",
		"题目": "802.11无线局域网主要采用了_________方法解决数据帧的碰撞问题。",
		"选项": [
			"A. 超时重传",
			"B. 预约信道",
			"C. 提高信噪比",
			"D. 碰撞检测"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149778",
		"题目": "以下关于无线局域网的描述中,错误的是_________",
		"选项": [
			"A. “冲突”现象发生在AP利用共享无线信道以“点对点”方式转发数据帧时",
			"B. 如果有两个或两个以上无线主机同时发送就会发生“冲突”",
			"C. 如果主机同时要将数据帧发送到基站AP时,将会导致“冲突”现象发生",
			"D. 无线局域网MAC层协议就是要解决多个无线主机对共享无线信道的争用问题"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149779",
		"题目": "IEEE 802.11 系列协议对应OSI模型的_________",
		"选项": [
			"A. 物理层和数据链路层",
			"B. 物理层",
			"C. 数据链路层和网络层",
			"D. 数据链路层"
		],
		"我的答案": " A",
		"标准答案": " A"
	}
]