questions[questions.length] = [
	{
		"ID": "question403149624",
		"题目": "数据报交换的特点不包括_________",
		"选项": [
			"A. 把较长的报文划分成较短的数据段",
			"B. 主机知道网络是否可以传送该分组",
			"C. 主机可以随时随地发送分组",
			"D. 每个分组的转发均基于首部的目的地址, 分组之间相互独立"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149625",
		"题目": "数据报从源节点到目的节点可能需要经过多个网络和路由器。在整个传输过程中,数据报报头中的_________",
		"选项": [
			"A. 源地址和目的地址都有可能发生变化",
			"B. 源地址有可能发生变化而目的地址不会发生变化",
			"C. 源地址不会发生变化而目的地址有可能发生变化",
			"D. 源地址和目的地址都不会发生变化"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149626",
		"题目": "_________能提供面向连接的服务",
		"选项": [
			"A. 数据报交换",
			"B. 虚电路交换",
			"C. 分组交换",
			"D. 报文交换"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149627",
		"题目": "______________不需要呼叫建立。",
		"选项": [
			"A. 数据报交换",
			"B. 虚电路交换",
			"C. 所有交换方式",
			"D. 电路交换"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149628",
		"题目": "计算机网络数据交换技术中,不属于分组交换技术的有_________",
		"选项": [
			"A. 电路交换",
			"B. 数据报",
			"C. 虚电路",
			"D. 源路由"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149629",
		"题目": "下列交换技术中,节点不采用“存储—转发”方式的是_________",
		"选项": [
			"A. 报文交换技术",
			"B. 电路交换技术",
			"C. 数据报交换技术",
			"D. 虚电路交换技术"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149630",
		"题目": "在下列关于交换技术的描述中,哪一项说法是正确的?_________",
		"选项": [
			"A. 在通信的两个主机之间只能建立一条虚电路",
			"B. 虚电路的沿途节点需要为每个分组作路径选择判定",
			"C. 虚电路也有连接建立、数据传输、连接释放三阶段",
			"D. 虚电路与电路交换中的电路没有实质不同"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149631",
		"题目": "在下列关于交换技术的描述中,哪一项说法是正确的?_________",
		"选项": [
			"A. 一旦数据报线路建立,消息在分组中传送",
			"B. 在发短消息时,数据报比虚电路报文分组交换,甚至比电路交换更快",
			"C. 数据报使用呼叫请求报文分组,这在每个节点上都会产生延迟",
			"D. 对电路交换来说,在信息发送之前没有时间延迟"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149632",
		"题目": "在下列对虚电路方法的陈述中,哪一项说法有误?_________",
		"选项": [
			"A. 由于路由在逻辑连接期间是固定的,同电路交换网络的线路类似",
			"B. 在任何报文分组发送之前,都预先计划好发送路由",
			"C. 报文分组在虚电路上传递时无须对每个报文分组进行路由选择",
			"D. 该方法的健壮性较数据报方法好"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149633",
		"题目": "_________方式需在两站之间建立一条专用通路。",
		"选项": [
			"A. 报文交换",
			"B. 电路交换",
			"C. 虚电路分组交换",
			"D. 数据报分组交换"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149634",
		"题目": "在有关虚电路交换的描述中,哪一项有错误?_________",
		"选项": [
			"A. 各虚电路要占据路由表空间",
			"B. 按报文分组为单位选择路由",
			"C. 需要建立连接",
			"D. 每个报文分组都携有较短的虚电路号"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149635",
		"题目": "在有关数据报交换的描述中,哪一项有错误?_________",
		"选项": [
			"A. 每个报文分组都携有完整的信源/信宿地址",
			"B. 不需要建立连接",
			"C. 所有报文分组经由同样的路由传递",
			"D. 网络设备无需储存交换的状态信息"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149636",
		"题目": "______允许数据分组含有电路号,而不用目的端的全地址。",
		"选项": [
			"A. 电路交换",
			"B. 虚电路和数据报交换",
			"C. 数据报交换",
			"D. 虚电路交换"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149637",
		"题目": "下列组合中,各术语都属于计算机网络的数据交换技术的是_________",
		"选项": [
			"A. 帧交换、电路交换、数据报",
			"B. 线路交换、包交换、存储转发交换",
			"C. 虚电路、报文交换、分组交换",
			"D. 帧交换、电路交换、虚电路"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149638",
		"题目": "以下各项中,不是数据报交换操作特点的是_________",
		"选项": [
			"A. 每个分组自身携带有足够的信息,它的传送是被单独处理的",
			"B. 使所有分组按顺序到达目的端系统",
			"C. 在整个传送过程中,不需建立虚电路",
			"D. 网络节点要为每个分组做出路由选择"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149639",
		"题目": "集线器的缺点是_________",
		"选项": [
			"A. 不能延伸网络可操作的距离",
			"B. 不能在网络上发送变弱的信号",
			"C. 不能放大变弱的信号",
			"D. 不能隔离网络冲突域"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149640",
		"题目": "网桥实现的功能不包括_________",
		"选项": [
			"A. 转发数据帧",
			"B. 扩展LAN",
			"C. 过滤数据帧",
			"D. 处理数据帧"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149641",
		"题目": "网桥工作在哪一层?_________",
		"选项": [
			"A. 网络层",
			"B. 数据链路层",
			"C. 物理层",
			"D. 应用层"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149642",
		"题目": "网桥可以访问同一个网络中站点的______地址。",
		"选项": [
			"A. 服务访问点",
			"B. 物理",
			"C. IP",
			"D. 网络"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149643",
		"题目": "透明网桥是通过查找端口-地址表来决定转发路径的,而端口-地址表是_________生成的。",
		"选项": [
			"A. 由网络管理员在设置网桥时通过手工输入",
			"B. 通过广播一个探测帧来搜集路径信息",
			"C. 网桥通过自学习方法", // 透明网桥也会自学习
			"D. 网桥通过正向自学习方法"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149644",
		"题目": "网桥通过将帧中的________和自己地址表中的信息进行比较,实现帧的转发和过滤。",
		"选项": [
			"A. 目的节点IP地址",
			"B. 源节点的物理地址",
			"C. 源节点IP地址",
			"D. 目的节点的物理地址"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149645",
		"题目": "某一链路带宽为100Mbps的交换机有20个端口,则每个端口的传输速率为_________",
		"选项": [
			"A. 2000Mbps",
			"B. 5Mbps",
			"C. 100Mbps",
			"D. 10Mbps"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149646",
		"题目": "数据报交换中,交换机根据_________选择分组转发时的输出端口。",
		"选项": [
			"A. 分组首部所记录的路径",
			"B. 分组首部中的源地址",
			"C. 分组首部中的目的地址",
			"D. 分组所属的电路号"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149647",
		"题目": "有10个站连接到以太网上。若10个站都连接到一个10Mbit/s以太网集线器上,则每个站能得到的带宽为_________;若10个站都连接到一个10Mbit/s以太网交换机上,则每个站得到的带宽为_________。",
		"选项": [
			"A. 共享10Mbit/s,独占10Mbit/s",
			"B. 独占10Mbit/s,独占10Mbit/s",
			"C. 共享10Mbit/s,共享10Mbit/s",
			"D. 独占10Mbit/s,共享10Mbit/s"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149648",
		"题目": "用集线器连接起来的10Mbps共享式以太网,若共有10个用户,则每个用户能够占有的平均带宽约为_________",
		"选项": [
			"A. 2Mbps",
			"B. 1Mbps",
			"C. 10Mbps",
			"D. 100Mbps"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149649",
		"题目": "下面关于虚拟局域网VLAN的叙述错误的是_________",
		"选项": [
			"A. 虚拟局域网是一种新型局域网",
			"B. 每一个VLAN的工作站可处在不同的局域网中",
			"C. 利用以太网交换机可以很方便地实现VLAN",
			"D. VLAN是由一些局域网网段构成的与物理位置无关的逻辑组"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149650",
		"题目": "对于用交换机互连的没有划分VLAN的交换式以太网,哪种描述是错误的?_________",
		"选项": [
			"A. 交换机中所有端口属于一个广播域",
			"B. 交换机各端口可以并发工作",
			"C. 交换机中所有端口属于一个冲突域",
			"D. 交换机将信息帧只发送给目的端口"
		],
		"我的答案": " C",
		"标准答案": " C"
	}
]