questions[questions.length] = [
	{
		"ID": "question403149656",
		"题目": "下列哪个不是TCP的特性?_________",
		"选项": [
			"A. 字节流",
			"B. 全双工",
			"C. 可靠传输",
			"D. 支持广播"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149657",
		"题目": "关于传输层面向连接服务的特性是_______",
		"选项": [
			"A. 不保证可靠和顺序的交付",
			"B. 不保证可靠,但是保证顺序的交付",
			"C. 保证可靠,但不保证顺序的交付",
			"D. 保证可靠和顺序的交付"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149658",
		"题目": "面向连接的协议有_________",
		"选项": [
			"A. IP协议",
			"B. UDP协议",
			"C. TCP协议",
			"D. OSPF协议"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149659",
		"题目": "TCP/IP 网络中,_________与数据链路层有关,_________与网络层有关,_________和传输层有关。",
		"选项": [
			"A. 物理地址,逻辑地址,端口号",
			"B. IP地址,物理地址,端口号",
			"C. IP地址,端口号,物理地址",
			"D. 物理地址,IP地址,逻辑地址"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149660",
		"题目": "TCP 报头信息和 UDP 报头信息中都包含下列哪项信息?_________",
		"选项": [
			"A. 序列号",
			"B. 端口号",
			"C. 窗口大小",
			"D. 选项字段"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149661",
		"题目": "数据段的TCP报头中为什么包含端口号?_________",
		"选项": [
			"A. 指示转发数据段时应使用的正确路由器接口",
			"B. 标识接收或转发数据段时应使用的交换机端口",
			"C. 确定封装数据时应使用的第3层协议",
			"D. 让接收主机转发数据到适当的应用进程"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149662",
		"题目": "一个TCP连接过程包括_________",
		"选项": [
			"A. 拨号,通话,挂机",
			"B. 连接建立、数据传输、连接释放",
			"C. 下载、安装、使用",
			"D. 注册、登陆、使用"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149663",
		"题目": "TCP可靠传输所依赖的数据结构不包括_________",
		"选项": [
			"A. 序号",
			"B. IP地址",
			"C. 确认号",
			"D. 连接建立和释放的标志字段"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149664",
		"题目": "IP层负责_________的通信,TCP层负责_________的通信。",
		"选项": [
			"A. 主机到主机、进程到进程",
			"B. 进程到进程、主机到主机",
			"C. 进程到进程、端到端",
			"D. 主机到进程、进程到主机"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149665",
		"题目": "TCP协议使用三次握手来建立连接,TCP协议规定,在对发送端SYN确认信息中,同时捎带_________以减少通信的量。",
		"选项": [
			"A. 上一个已接收的报文编号",
			"B. 下一个希望接受的报文编号",
			"C. 对发送进程的连接请求SYN",
			"D. 对发送进程的请求确认ACK"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149666",
		"题目": "TCP协议在每次建立连接时,都要在收发双方之间交换的报文段数为_________",
		"选项": [
			"A. 2个",
			"B. 3个",
			"C. 4个",
			"D. 1个"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149667",
		"题目": "TCP的通信双方,有一方发送了带有FIN标志的数据段后表示_________",
		"选项": [
			"A. 将断开通信双方的TCP连接",
			"B. 单方面释放连接,表示本方已经无数据发送,但可以接收对方的数据",
			"C. 中止数据发送,双方都不能发送数据",
			"D. 连接被重新建立"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149668",
		"题目": "关于接收窗口,以下哪一项描述是错误的?_________",
		"选项": [
			"A. 接收缓存大小影响接收窗口大小",
			"B. 接收窗口大小与接收端应用层处理能力无关",
			"C. 接收窗口是接收端允许接收非按序到达的字节的序号范围",
			"D. 传输层向应用层提交数据的方式影响接收窗口大小"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149669",
		"题目": "在TCP/IP中,实施流量控制的目的是_________",
		"选项": [
			"A. 避免网络出现拥塞",
			"B. 保证接收方总是来得及接收发送方发出的报文或分组",
			"C. 帮助用户节省上网开支",
			"D. 避免不良用户偷窃网络流量"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149670",
		"题目": "哪种策略不是TCP可靠传输协议的控制策略?_________",
		"选项": [
			"A. 累计确认重传机制",
			"B. 校验和",
			"C. 数据片序号",
			"D. 进程端口号"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149671",
		"题目": "假设TCP接收端发送一个10000的ACK,接收窗口字段设置为4000。下列哪个选项最好地描述了接收端状态?_________",
		"选项": [
			"A. 接收端预期的下一个数据是10000序列号,并且它具有的缓冲空间可以用来接收到包括13999序列号的数据",
			"B. 接收端告诉发送端,当它接收到消息时它可能会发送多于4000字节的数据(按序列号顺序)",
			"C. 接收端在序列空间(12000~15999)的任何位置都可接收4000字节的新数据",
			"D. 接收端的缓冲空间可以用来接收到序列号4000的数据"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149672",
		"题目": "当TCP接收端获得一个有效载荷大小是1000和序列号为8000的数据段时,有效载荷中的最后一个字节的序列号是多少?_________",
		"选项": [
			"A. 7999",
			"B. 9000",
			"C. 8000",
			"D. 8999"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149673",
		"题目": "主机A和主机B之间建立了一个TCP连接,主机A向主机B发送了3个连续的TCP段,分别包含300B、400B和500B的有效载荷,第3个段的序号为900。若主机B仅仅正确收到第1个和第3个数据段,则主机B发送给主机A的确认序号为_________",
		"选项": [
			"A. 300",
			"B. 500",
			"C. 1200",
			"D. 1400"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149674",
		"题目": "主机甲与主机乙已经建立了一个TCP连接。主机甲向主机乙发送了两个连续的TCP段,分别包含300字节和500字节的有效载荷,第一个段的起始序号为200,主机乙正确收到这两个数据段后,发送给主机甲的确认序号为_________",
		"选项": [
			"A. 500",
			"B. 700",
			"C. 800",
			"D. 1000"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149675",
		"题目": "主机甲和主机乙之间已经建立一个TCP连接,双方持续有效传输,若甲收到乙的一个TCP段,序号1913,确认序号2046,有效载荷100字节,则甲发送给乙的TCP段的序号和确认序号可能是_________",
		"选项": [
			"A. 2046, 2012",
			"B. 2046, 2013",
			"C. 2047, 2013",
			"D. 2047, 2014"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149676",
		"题目": "主机A和主机B之间建立了一个TCP连接,TCP最大的数据段长度为1000字节,若主机A当前的拥塞窗口为4000字节,在主机A向主机B连续发送两个最大段之后,成功收到主机B回复的第一段的确认,确认报文中通告的接收窗口大小为2000字节,则此时主机A还可以向主机B发送的最大字节数是_________",
		"选项": [
			"A. 0",
			"B. 1000",
			"C. 2000",
			"D. 3000"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149677",
		"题目": "主机甲向主机乙发送了一个连接建立请求(SYN=1, seq = 11220),若主机乙接受该请求,主机乙的回复可能是_________",
		"选项": [
			"A. (SYN=0, ACK=0, seq=11221, ack=11221)",
			"B. (SYN=1, ACK=1, seq=11220, ack=11220)",
			"C. (SYN=1, ACK=1, seq=11221, ack=11221)",
			"D. (SYN=0, ACK=0, seq=11220, ack=11220)"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149678",
		"题目": "主机A基于TCP向主机B连续发送3个TCP报文段。第1个报文段的序号为90,第2个报文段的序号为120,第3个报文段的序号为150。\n第1个报文段里面的数据有___(1)____字节。\n第2个报文段里面的数据有___(2)____字节。\n假设第2个报文段丢失了,而其他两个报文段抵达了主机B,B回复A的确认报文的确认号应该为___(3)____。",
		"选项": [
			"A. (1)30 (2)30 (3)120",
			"B. (1)30 (2)30 (3)150",
			"C. (1)90 (2)120 (3)180",
			"D. (1)90 (2)120 (3)150"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149679",
		"题目": "TCP的拥塞控制算法中,当拥塞窗口cwnd达到哪一个值时,进行线性增长?",
		"选项": [
			"A. 接收窗口rwnd",
			"B. 慢启动阈值ssth",
			"C. 发送窗口wnd",
			"D. 慢启动阈值ssth一半"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149680",
		"题目": "在进行流量控制和拥塞控制时,发送端的发送窗口上限值应取“接收方窗口”和“拥塞窗口”的_________。",
		"选项": [
			"A. 较大的一个",
			"B. 较小的一个",
			"C. 二者之和",
			"D. 二者之差"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149681",
		"题目": "TCP拥塞控制方法中,不正确的描述是:",
		"选项": [
			"A. 当已发送报文段的应答到达,拥塞窗口大小加倍",
			"B. 以分组丢失或超时为拥塞标志",
			"C. 当属于一个拥塞窗口的某个已发送报文段丢失,拥塞窗口大小开始线性增长",
			"D. 发送方取“拥塞窗口”和“接收方通告窗口”两者最小值作为发送窗口"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149682",
		"题目": "以下关于拥塞的描述中,正确的是_________",
		"选项": [
			"A. 拥塞会引发分组丢失",
			"B. 拥塞不会引起分组丢失但会导致分组延迟到达目的地",
			"C. 只要合理分配网络资源,就能完全避免拥塞",
			"D. 拥塞会引发分组丢失但不会导致分组延迟到达目的地"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149683",
		"题目": "TCP协议中观察网络拥塞的办法是_________",
		"选项": [
			"A. 收到ICMP差错报告报文",
			"B. 以超时作为网络拥塞的标志",
			"C. 以窗口大小作为判断网络拥塞的依据",
			"D. 以建立TCP连接的个数作为网络拥塞的依据"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149684",
		"题目": "在TCP协议中,如果发送窗口直接按照接收方的通知窗口设置,其结果是_________",
		"选项": [
			"A. 可能导致分组无法到达接收方",
			"B. 可能导致接收方丢弃分组",
			"C. 不考虑物理信道的可靠性时,能保证分组总是能到达接收方",
			"D. 能实现资源预留"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149685",
		"题目": "在TCP协议中,如果发送方收到三个重复的ACK后, 发送方将会_________",
		"选项": [
			"A. 快速将发送窗口调整到一个更大的值",
			"B. 快速重传未被确认的报文段",
			"C. 立刻启动三次握手过程",
			"D. 立刻报告差错已经发生"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149686",
		"题目": "考虑在一个具有10ms往返时延的线路上采用慢启动拥塞机制。假设没有发生网络拥塞,该TCP的报文段大小为2KB,接收方可用接收窗口为24KB。那么发送方需要________时间才能达到该接收窗口大小。",
		"选项": [
			"A. 30ms",
			"B. 40ms",
			"C. 50ms",
			"D. 60ms"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149687",
		"题目": "设TCP的拥塞窗口的慢启动门限值初始为12(单位为报文段),当拥塞窗口达到16时出现超时,再次进入慢启动过程。问从这时起,需要_________次传输轮次才能恢复到超时那时的拥塞窗口大小。",
		"选项": [
			"A. 8",
			"B. 12",
			"C. 14",
			"D. 16"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149688",
		"题目": "有一个TCP连接,当其拥塞窗口为32个分组大小时超时。假设网络的RTT是固定的,为5s,不考虑比特开销(即分组不丢失),则系统在超时后处于慢启动的时间有_________",
		"选项": [
			"A. 10s",
			"B. 20s",
			"C. 30s",
			"D. 40s"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149689",
		"题目": "若主机甲与主机乙已建立一条TCP连接,最大段长(MSS)为1KB,往返时间(RTT)为2ms,则在不出现拥塞的前提下,当前ssthread为8KB,拥塞窗从8KB增长到32KB所需的最短时间是_________",
		"选项": [
			"A. 4ms",
			"B. 8ms",
			"C. 24ms",
			"D. 48ms"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149690",
		"题目": "主机甲和主机乙建立了一个TCP连接,甲的拥塞控制初始阀值为32KB,甲向乙始终以MSS=1KB大小的数据段发送数据,并且一直有数据发送;乙为该连接分配了16KB的接收缓存,并对每个数据段进行确认,忽略段的传输时延。若乙收到的数据全部存入缓存,不被取走,则甲从连接建立成功时刻起,未发送超时的情况下,经过4个RTT之后,甲的发送窗口是_________",
		"选项": [
			"A. 1KB",
			"B. 8KB",
			"C. 16KB",
			"D. 32KB"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149691",
		"题目": "主机甲与主机乙已经建立了一个TCP连接。主机甲始终以MSS=1KB大小的数据段发送数据,并且一直有数据发送;主机乙收到一个数据段后都会发出一个接收窗口为10KB的确认段。若甲在t时刻发生超时时拥塞窗口为8KB,则从t时刻起,不再发生超时的情况下,经过10个RTT,甲的发送窗口大小为_________",
		"选项": [
			"A. 10KB",
			"B. 12KB",
			"C. 14KB",
			"D. 15KB"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149692",
		"题目": "在一个TCP连接中,MSS为1KB,当拥塞窗口为34KB时收到了3个重复的ACK报文。如果在接下来的4个RTT内报文段传输都是成功的,那么当这些报文段均得到确认后,拥塞窗口的大小为_________",
		"选项": [
			"A. 8KB",
			"B. 16KB",
			"C. 20KB",
			"D. 21KB"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149693",
		"题目": "在一个TCP连接中,MSS为1KB,发送方有足够多的数据要发送,当拥塞窗口为16KB时发生了超时,如果接下来的4个RTT时间内TCP段的传输都是成功的,那么当第4个RTT个时间内发送的所有TCP段都得到肯定应答时,拥塞窗口的大小为_________",
		"选项": [
			"A. 7KB",
			"B. 8KB",
			"C. 9KB",
			"D. 16KB"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149694",
		"题目": "有一个TCP连接,当其拥塞窗口为32个报文段时超时。假设网络的RTT是固定的50ms,不考虑比特开销,即分组不丢失,则系统在超时后处于慢启动阶段的时间有_________",
		"选项": [
			"A. 100ms",
			"B. 150ms",
			"C. 200ms",
			"D. 250ms"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149695",
		"题目": "假设一个TCP流在慢启动阶段,k个数据段在t与t+RTT之间被发送。假设仍然保持在慢启动阶段,预期有多少个数据段在t+RTT和t+2*RTT发送?_________",
		"选项": [
			"A. k",
			"B. k+1",
			"C. 2 ^k",
			"D. 2k"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149696",
		"题目": "多媒体应用经常不使用TCP的原因可能是_________",
		"选项": [
			"A. TCP不能提供可靠的传输服务",
			"B. 音视频数据无法封装为TCP报文段",
			"C. 不希望数据传输速率受限于拥塞窗口",
			"D. TCP不能提供多媒体数据的压缩服务"
		],
		"我的答案": " C",
		"标准答案": " C"
	}
]