questions[questions.length] = [
	{
		"ID": "question403149507",
		"题目": "1.关于网络互联,下列描述中最为正确的是_________",
		"选项": [
			"A. 连接多个网络,以中继这些网络之间的分组传输",
			"B. 连接多个网络,以扩展网络规模",
			"C. 连接多个不同类型网络,使得这些网络中的主机能够相互通信",
			"D. 连接多个不同类型网络,对于这些网络之间传输的分组进行协议转换"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149508",
		"题目": "面向无连接的IP协议的信息传输方式是_________",
		"选项": [
			"A. 广播",
			"B. 点到点",
			"C. 数据报",
			"D. 虚电路"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149509",
		"题目": "Internet网络层提供的服务是_________",
		"选项": [
			"A. 无连接可靠的数据报服务",
			"B. 有连接不可靠的虚电路服务",
			"C. 有连接可靠的虚电路服务",
			"D. 无连接不可靠的数据报服务"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149510",
		"题目": "下列描述中,不属于IP层实现的功能是_________",
		"选项": [
			"A. 尽力而为的不可靠传输服务",
			"B. 数据报的分段与重组",
			"C. 确定主机进程间的接口",
			"D. 数据报的路由选择与转发"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149511",
		"题目": "关于IP提供的服务,下列说法正确的是_________",
		"选项": [
			"A. IP提供不可靠的数据报服务,因此分组的传送不能得到保障",
			"B. IP提供可靠的虚电路服务,因此它不能随意丢弃分组",
			"C. IP提供可靠的虚电路服务,因此数据报的传送受到保障",
			"D. IP提供不可靠的数据报服务,因此它可以随意丢弃分组"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149512",
		"题目": "为了防止IP数据包在因特网上无限制地传递,告知路由器是否应该丢弃某个数据包,在IP数据包首部设置了_________字段",
		"选项": [
			"A. 生存时间",
			"B. 标识",
			"C. 目的IP",
			"D. 服务类型"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149513",
		"题目": "在MTU较小的网络,需将数据报分成若干较小的部分进行传输,这种较小的部分叫做_________",
		"选项": [
			"A. Segment报文段",
			"B. Packet分组",
			"C. Fragment分片",
			"D. Datagram数据报"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149514",
		"题目": "在IP数据报报文中,标识、标志、片偏移3个字是与控制_________有关",
		"选项": [
			"A. 封装",
			"B. 生存周期",
			"C. 分片与重组",
			"D. 服务类型"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149515",
		"题目": "下列关于IP数据报分片和重组描述正确的是_________",
		"选项": [
			"A. 分片在一经过路由器时就进行,重组也一样",
			"B. 分片只可能发生在路由器,而重组必须在目的机",
			"C. 分片在信源机,重组在目的机",
			"D. 分片只可能发生在路由器,而重组可能发生在目的机,也可能发生在路由器"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149516",
		"题目": "考虑转发长度为1600字节的IP数据包到MTU=500字节的物理网络,则四个分片的偏移量分别为_________",
		"选项": [
			"A. 0, 450, 950, 1450",
			"B. 0, 500, 1000, 1500",
			"C. 0, 480, 960, 1440",
			"D. 上述答案都不对"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149517",
		"题目": "Internet上的各种不同网络及不同类型的计算机进行互联的基础是_________",
		"选项": [
			"A. HTTP",
			"B. TCP",
			"C. DNS",
			"D. IP"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149518",
		"题目": "如果网络层使用数据报服务,那么需要_________",
		"选项": [
			"A. 在连接建立时做一次路由选择",
			"B. 仅在网络拥塞时做新的路由选择",
			"C. 为每个到来的分组做路由选择",
			"D. 不必做路由选择"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149519",
		"题目": "IP层广播数据包传输_________",
		"选项": [
			"A. 仅限于单台路由器单个端口连接的IP网络", // 家用路由器那种不算，这题有点奇怪
			"B. 跨越多台路由器;",
			"C. 跨越多台同一类型数据链路层交换机;", // IP层，交换机是数据链路层
			"D. 仅限于单台数据链路层交换机;"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149520",
		"题目": "IP数据包在全采用以太网链接的同一IP子网中传输时,则_________",
		"选项": [
			"A. IP地址和MAC地址均会变化",
			"B. IP地址和MAC地址均不变;",
			"C. IP地址逐跳变化,MAC地址不变;",
			"D. IP地址不变,MAC地址逐跳变化;"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149521",
		"题目": "IP数据包跨越路由器的端到端传输过程中,如不经过NAT网关,则_________",
		"选项": [
			"A. IP地址逐跳变化,MAC地址不变;",
			"B. IP地址不变,MAC地址逐跳变化;",
			"C. IP地址和MAC地址均会变化",
			"D. IP地址和MAC地址均不变;"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149522",
		"题目": "IP数据包跨越路由器的端到端传输过程中,如有经过NAT网关,则_________",
		"选项": [
			"A. IP地址逐跳变化,MAC地址不变;",
			"B. IP地址不变,MAC地址逐跳变化;",
			"C. IP地址可能会变化,MAC地址逐跳变化",
			"D. IP地址和MAC地址均不变;"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149523",
		"题目": "IP地址是网际层中识别主机的_________",
		"选项": [
			"A. 逻辑地址",
			"B. 前置地址",
			"C. 物理地址",
			"D. 虚拟地址"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149524",
		"题目": "下列不能缓解IP地址危机问题的是_________",
		"选项": [
			"A. NAT",
			"B. DHCP",
			"C. CIDR",
			"D. IPv6"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149525",
		"题目": "网络号在一个IP地址中起什么作用?_________",
		"选项": [
			"A. 它规定了主机所属的网络",
			"B. 它规定了网络上的哪个节点正在被寻址",
			"C. 它规定了网络上计算机的身份",
			"D. 它规定了设备可以与哪些网络进行通讯"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149526",
		"题目": "下列属于B类IP地址的是_________",
		"选项": [
			"A. 128.2.2.10",
			"B. 192.168.0.1",
			"C. 202.96.209.5",
			"D. 20.113.233.246"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149527",
		"题目": "如采用有类别编址,IP地址135.7.69.28属于_________类地址。",
		"选项": [
			"A. D类",
			"B. C类",
			"C. A类",
			"D. B类"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149528",
		"题目": "C类地址的最高三个比特位,依次是_________",
		"选项": [
			"A. 101",
			"B. 110",
			"C. 010",
			"D. 100"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149529",
		"题目": "以下地址中,不是子网掩码的是_________",
		"选项": [
			"A. 255.241.0.0",
			"B. 255.255.0.0",
			"C. 255.255.254.0",
			"D. 255.255.255.0"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149530",
		"题目": "一个IP网段需要划分子网,且每个子网的主机IP需要14个,应当使用的掩码是_________",
		"选项": [
			"A. 255.255.255.240",
			"B. 255.255.255.248",
			"C. 255.255.255.224",
			"D. 255.255.255.128"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149531",
		"题目": "如果用户网络需要划分5个子网,每个子网最多20台主机,则适用的子网掩码是_________",
		"选项": [
			"A. 255.255.255.240",
			"B. 255.255.255.248",
			"C. 255.255.255.224",
			"D. 255.255.255.192"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149532",
		"题目": "某公司申请到一个C类网络,由于有地理位置上的考虑切割成5个大小相同的子网,请问子网掩码要设为_________",
		"选项": [
			"A. 255.255.255.192",
			"B. 255.255.255.240",
			"C. 255.255.255.254",
			"D. 255.255.255.224"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149533",
		"题目": "IP地址129.66.51.37(子网掩码为255.255.0.0),其网络号为_________",
		"选项": [
			"A. 129.66",
			"B. 37",
			"C. 129.66.51",
			"D. 129"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149534",
		"题目": "某主机IP地址为135.7.69.28,网络掩码为255.255.254.0,其网络号为_________。",
		"选项": [
			"A. 135.7.68.0",
			"B. 135.7.69.0",
			"C. 135.7.66.0",
			"D. 135.7.67.0"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149535",
		"题目": "IP地址为191.168.200.2,子网掩码为255.255.255.192,则网络标识为_________",
		"选项": [
			"A. 191.168.200.128",
			"B. 191.0.0.0",
			"C. 191.168.200.0",
			"D. 191.168.200.192"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149536",
		"题目": "一个主机的IP地址为192.168.5.121,子网掩码为255.255.255.248,那么该主机的网络号是_________",
		"选项": [
			"A. 192.168.5.32",
			"B. 192.168.5.121",
			"C. 192.168.5.12",
			"D. 192.168.5.120"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149537",
		"题目": "哪个地址是网络123.10.0.0(掩码为255.255.0.0)的广播地址?_________",
		"选项": [
			"A. 123.13.0.0",
			"B. 123.1.1.1",
			"C. 123.255.255.255",
			"D. 123.10.255.255"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149538",
		"题目": "某主机IP地址为135.7.69.28,网络掩码为255.255.254.0,所在IP网络广播地址为_________。",
		"选项": [
			"A. 135.7.66.255",
			"B. 135.7.67.255",
			"C. 135.7.68.255",
			"D. 135.7.69.255"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149539",
		"题目": "一台主机的IP地址为202.113.224.70,子网掩码为255.255.255.240,那么该主机的主机号为_________",
		"选项": [
			"A. 6",
			"B. 68",
			"C. 4",
			"D. 8"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149540",
		"题目": "与10.110.12.29 (掩码为255.255.255.224) 属于同一网段的主机IP地址是______",
		"选项": [
			"A. 10.110.12.30",
			"B. 10.110.12.0",
			"C. 10.110.12.31",
			"D. 10.110.12.32"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149541",
		"题目": "哪组网络地址和子网掩码正确标识了172.16.128.0--172.16.159.255地址块?_________",
		"选项": [
			"A. 172.16.128.0、255.255.255.224",
			"B. 172.16.128.0、255.255.0.0",
			"C. 172.16.128.0、255.255.240.0",
			"D. 172.16.128.0、255.255.224.0"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149542",
		"题目": "在IP地址为192.168.1.*的网络中,如果网络掩码为255.255.255.0,则该网络的网络地址为_________,广播地址为_________,主机可用IP地址范围为_________",
		"选项": [
			"A. 192.168.1.0;192.168.1.255;192.168.1.1--192.168.1.254",
			"B. 192.168.1.0;192.168.1.255;192.168.1.0--192.168.1.255",
			"C. 192.168.1.255;192.168.1.0;192.168.1.1--192.168.1.254",
			"D. 192.168.1.255;192.168.1.0;192.168.1.0--192.168.1.255"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149543",
		"题目": "假定某网络的IP地址空间为192.168.5.0/24,采用的子网掩码为255.255.255.248,则该网络的最大子网个数为_________,每个子网内的最大可分配IP地址个数为_________",
		"选项": [
			"A. 8,30",
			"B. 32,6",
			"C. 8,32",
			"D. 32,8"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149544",
		"题目": "一个B类网络172.16.0.0,使用子网掩码255.255.255.192来划分子网,则理论上可以利用的网络数和每个网络中的主机数分别为_________",
		"选项": [
			"A. 1024、62",
			"B. 2、62",
			"C. 1000、62",
			"D. 512、126"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149545",
		"题目": "关于无分类编址CIDR,下列说法不正确的是_________",
		"选项": [
			"A. 网络前缀越短,其地址块所包含的地址数就越少",
			"B. 使用CIDR,查找路由表时可能会得到多个匹配结果,应当从匹配结果中选择具有最长网络前缀的路由。因为网络前缀越长,路由就越具体",
			"C. CIDR将网络前缀都相同的连续的IP地址组成“CIDR”地址块",
			"D. CIDR使用各种长度的“网络前缀”来代替分类地址中的网络号和子网号"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149546",
		"题目": "CIDR将_________都相同的连续的IP地址组成“CIDR”地址块,路由表就利用CIDR地址块来查找目的网络。",
		"选项": [
			"A. 主机地址",
			"B. 物理地址",
			"C. 路由协议",
			"D. 网络前缀"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149547",
		"题目": "把网络202.112.78.0/24划分为多个大小相同子网,子网掩码是255.225.255.192,则各子网中可用的主机地址数之和是_________",
		"选项": [
			"A. 252",
			"B. 254",
			"C. 250",
			"D. 248"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149548",
		"题目": "在子网192.168.4.0/30中,能接收目的地址为192.168.4.3的IP分组的最大主机数是_________",
		"选项": [
			"A. 0",
			"B. 1",
			"C. 2",
			"D. 4"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149549",
		"题目": "假设目的IP地址为200.200.21.1,路由表中默认路由为:0.0.0.0,倒数第2条记录是: 200.200.16.0/20,最后一条记录是: 200.200.21.0/24。则路由选择的结果为_________",
		"选项": [
			"A. 200.200.16.0/20",
			"B. 200.200.21.0/24",
			"C. 200.200.16.1",
			"D. 0.0.0.0"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149550",
		"题目": "四条路由:124.23.129.0/24,124.23.130.0/24,124.23.132.0/24和124.23.133.0/24经过汇聚后得到的网络地址是_________",
		"选项": [
			"A. 124.33.128.0/23",
			"B. 124.23.128.0/22",
			"C. 124.23.128.0/21",
			"D. 124.23.130.0/22"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149551",
		"题目": "因特网将整个网络划分为许多较小的单位,即AS。由此,路由协议也分为两大类,即:_________",
		"选项": [
			"A. TCP和IP",
			"B. 内部网关协议和外部网关协议",
			"C. RIP和OSPF",
			"D. BGP和RIP"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149552",
		"题目": "路由器的路由表_________",
		"选项": [
			"A. 包含到达目的网络的完整路径信息",
			"B. 包含到达目的主机的完整路径信息",
			"C. 包含到达目的网络的下一跳信息",
			"D. 包含到达目的主机的下一跳路径信息"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149553",
		"题目": "使用链路状态路由选择算法的OSPF和使用距离向量路由选择算法的RIP都是_________",
		"选项": [
			"A. TCP/IP协议",
			"B. 域间路由协议",
			"C. 内部网关协议",
			"D. 外部网关协议"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149554",
		"题目": "不属于路由选择协议的是:_________",
		"选项": [
			"A. BGP",
			"B. ICMP",
			"C. OSPF",
			"D. RIP"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149555",
		"题目": "在距离向量路由中,每个路由器从________接收距离向量。",
		"选项": [
			"A. 两跳距离内的路由器",
			"B. 通过软件存储的表格",
			"C. 它的邻居路由器",
			"D. 网络中的每个路由器"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149556",
		"题目": "以下关于距离向量路由选择的描述中,错误的是_________",
		"选项": [
			"A. RIP要求路由器都要维护从它到每个内部路由器的距离向量",
			"B. 每经过一个路由器,距离值加1",
			"C. 路由表更新时可以找到前往每个网络的所有最短路径",
			"D. 与路由器直接连接的网络的距离值为0"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149557",
		"题目": "RIP路由算法所支持的最大有效跳数为_________",
		"选项": [
			"A. 10",
			"B. 16",
			"C. 32",
			"D. 15"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149558",
		"题目": "以下关于RIP的描述中,错误的是_________",
		"选项": [
			"A. RIP要求路由器按照一定的时间间隔发布距离向量信息",
			"B. RIP要求路由器向整个AS的路由器发布距离向量信息",
			"C. RIP要求路由器将它关于整个AS的距离向量信息发布出去",
			"D. RIP是基于距离向量路由选择算法的"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149559",
		"题目": "关于RIP协议描述不正确的是_________",
		"选项": [
			"A. 采用周期性分发和触发更新两种方式分发网络拓扑信息",
			"B. 每个节点会构造一个包含到所有邻居节点的”距离”的一维数组",
			"C. 每个节点会构造一个包含到所有其他节点的”距离”的一维数组",
			"D. 节点根据接收到的距离向量计算到达其他所有节点的最短路径的下一跳"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149560",
		"题目": "以下关于链路状态路由的描述中,错误的是_________",
		"选项": [
			"A. 链路状态的“度量”可以是距离、带宽、时延或者费用等",
			"B. 链路状态路由要求每个路由器使用洪泛方法向AS中其它路由器发送链路状态消息",
			"C. OSPF使用链路状态算法来实现AS内部路由表的更新",
			"D. 链路状态协议要求每隔10s向AS中其它的路由器发送路由信息"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149561",
		"题目": "关于链路状态协议的描述中错误的是_________",
		"选项": [
			"A. 采用洪泛技术更新链路变化信息",
			"B. 全网路由器的拓扑数据库是一致的",
			"C. 仅相邻节点交换各自路由表",
			"D. 具有快速收敛的优点"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149562",
		"题目": "如果在一个使用链路状态路由的互连网络中有5个路由器和6个网络,那么存在_____个路由表,每个表中至少有_____个表项?",
		"选项": [
			"A. 5,6",
			"B. 6,1",
			"C. 1,5",
			"D. 6,5"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149563",
		"题目": "如果在一个使用链路状态路由的互连网络中有5个路由器和6个网络,那么在路由器中存在多少个不同的链路状态数据库?_________",
		"选项": [
			"A. 5",
			"B. 30",
			"C. 6",
			"D. 1"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149564",
		"题目": "在链路状态路由中,洪泛使链路状态的变化能够被________记录",
		"选项": [
			"A. 所有路由器",
			"B. 个别路由器",
			"C. 所有网络",
			"D. 相邻路由器"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149565",
		"题目": "洪泛法的基本思想是_________",
		"选项": [
			"A. 收到的信息都会根据目的IP地址转发",
			"B. 收到的信息都会通过最短路径转发",
			"C. 收到的信息都会往除了输入端口外的所有其它端口转发",
			"D. 收到的信息都会根据目的MAC地址转发"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149566",
		"题目": "以下关于OSPF协议的描述中,最准确的是_________",
		"选项": [
			"A. OSPF协议只能适用于小型网络",
			"B. OSPF协议不能根据网络通信情况动态地改变路由",
			"C. OSPF协议是用于自治系统之间的外部网关协议",
			"D. OSPF协议根据链路状态法计算最佳路由"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149567",
		"题目": "以下关于区域路由,错误的是_________",
		"选项": [
			"A. 主干路由器不能兼做区域边界路由器",
			"B. OSPF协议将一个自治域划分成若干区域,有一种特殊的区域叫做主干区域",
			"C. 在自治系统中有4类路由器:区域内部路由器、主干路由器、区域边界路由器和自治域边界路由器",
			"D. 域之间通过区域边界路由器互联"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149568",
		"题目": "OSPF协议的哪项特性保证了该协议支持大规模的自治系统?_________",
		"选项": [
			"A. 可靠传输",
			"B. 链路状态路由算法",
			"C. 划分区域",
			"D. 支持CIDR"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149569",
		"题目": "IP网络采用最短路径路由,下列描述中最为正确的是_________",
		"选项": [
			"A.\n\n路由算法以总跳数为指标计算最短路径；路由器执行路由算法，计算出到目的网络的最短路径，以及该路径对应的下一跳\n\n\n",
			"B.\n\n路由算法以总开销为指标计算最短路径；路由器执行路由算法，计算出到目的网络的最短路径对应的下一跳\n\n\n",
			"C.\n\n路由算法以总开销为指标计算最短路径；路由器执行路由算法，计算出到目的网络的最短路径，以及该路径对应的下一跳\n\n\n",
			"D.\n\n路由算法以总跳数为指标计算最短路径；路由器执行路由算法，计算出到目的网络的最短路径对应的下一跳\n\n\n"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149570",
		"题目": "下列路由协议列表中,_________中的协议均为域内路由协议",
		"选项": [
			"A. IS-IS、BGP、OSPF;",
			"B. RIP、OSPF、IS-IS",
			"C. RIP、OSPF、BGP;",
			"D. OSPF、EGP、RIP;"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149571",
		"题目": "以下关于BGP特征的描述中,错误的是_________",
		"选项": [
			"A. BGP路由器的路由表要包括分组到达目的网络的路径",
			"B. BGP要求相邻的AS边界路由器在路径变化时才交换路由信息",
			"C. BGP的路由选择算法是基于路径向量(Path Vector)算法",
			"D. BGP要求相邻的AS边界路由器之间交换到达目的网络的路径"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149572",
		"题目": "BGP协议中所交换的网络可达性信息是_________",
		"选项": [
			"A. 到达某个网络所经过的路径",
			"B. 到达某个网络的距离向量信息",
			"C. 到达某个网络的链路状态信息",
			"D. 到达某个网络的最短距离以及下一跳路由器"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149573",
		"题目": "下列选项中关于BGP协议说法错误的是_________",
		"选项": [
			"A. BGP采用路径向量算法",
			"B. BGP能够检测路由循环",
			"C. BGP通过UDP报文发布消息",
			"D. BGP支持路由汇聚"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149574",
		"题目": "直接封装RIP、OSPF、BGP报文的协议分别为_________",
		"选项": [
			"A. UDP、IP、TCP",
			"B. TCP、UDP、IP",
			"C. TCP、IP、UDP",
			"D. UDP、TCP、IP"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149575",
		"题目": "关于因特网的路由选择协议叙述不正确的是_________",
		"选项": [
			"A. BGP采用路径向量路由选择协议。BGP所交换的网络可达性信息是要到达某个网络所要经过的自治系统序列",
			"B. 因特网采用静态的、分层次的路由选择协议",
			"C. RIP是基于距离向量的路由选择协议,RIP选择一个到目的网络具有最少路由器的路由",
			"D. OSPF最主要特征是使用分布式链路状态协议,所有的路由器最终都能建立一个链路状态数据库"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149576",
		"题目": "互联网中所有端系统和路由器都必须实现的协议是:_________",
		"选项": [
			"A. IP",
			"B. TCP",
			"C. HTTP",
			"D. SNMP"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149577",
		"题目": "以下关于IPv6地址“1A22: 120D: 0000: 0000: 72A2: 0000: 0000: 00C0”的不同表示法中,错误的是_________",
		"选项": [
			"A. 1A22:120D::72A2:0:0:C0",
			"B. 1A22:120D:0:0:72A2::C0",
			"C. 1A22:120D::72A2::00C0",
			"D. 1A22:120D::72A2:0000:0000:00C0"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149578",
		"题目": "某个IPv6地址为8::D0:123:CDEF:89A,其完整形式是_________",
		"选项": [
			"A. 0008:00D0:0000:0000:0000:0123:CDEF:089A",
			"B. 8000:0000:0000:0000:00D0:1230:CDEF:89A0",
			"C. 0008:0000:0000:0000:00D0:0123:CDEF:089A",
			"D. 8000:0000:0000:0000:D000:1230:CDEF:89A0"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149579",
		"题目": "每台路由器都依赖_________协议,否则该路由器不能正确工作。",
		"选项": [
			"A. RIP",
			"B. ARP",
			"C. BGP",
			"D. OSPF"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149580",
		"题目": "将IP地址转换为物理地址的协议是_________",
		"选项": [
			"A. IP",
			"B. ICMP",
			"C. RARP",
			"D. ARP"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149581",
		"题目": "将物理地址转换为IP地址的协议是_________",
		"选项": [
			"A. IP",
			"B. ICMP",
			"C. RARP",
			"D. ARP"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149582",
		"题目": "ARP的功能是_________",
		"选项": [
			"A. 根据IP地址查询域名",
			"B. 根据MAC地址查询IP地址",
			"C. 根据域名查询IP地址",
			"D. 根据IP地址查询MAC地址"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149583",
		"题目": "有关ARP协议描述不正确的是_________",
		"选项": [
			"A. ARP采用广播机制",
			"B. 由被询问的主机回答ARP查询",
			"C. 在ARP的实现中,有一个ARP服务器负责回答查询请求",
			"D. 给定目的主机的IP地址, ARP可以找到同属一个IP子网内部的目的主机的物理地址"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149584",
		"题目": "下列_________设备可以隔离ARP广播帧",
		"选项": [
			"A. 路由器",
			"B. 集线器",
			"C. 交换机",
			"D. 网桥"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149585",
		"题目": "下列哪种情况需要启动ARP请求?_________",
		"选项": [
			"A. 主机需要接收信息,但ARP表中已经具有了源IP地址与MAC地址的映射关系",
			"B. 主机需要接收信息,但ARP表中没有源IP地址与MAC地址的映射关系",
			"C. 主机需要发送信息,但ARP表中没有目的IP地址与MAC地址的映射关系",
			"D. 主机需要发送信息,但ARP表中已经具有了目的IP地址与MAC地址的映射关系"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149586",
		"题目": "ARP查询消息的传输是通过_________方式",
		"选项": [
			"A. 多播;",
			"B. 广播;",
			"C. 单播;",
			"D. 多对多"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149587",
		"题目": "将主机名转换成IP地址,要使_________协议,将IP 地址转换成MAC地址,要使用_________协议",
		"选项": [
			"A. DNS,ARP",
			"B. DNS,RARP",
			"C. DNS,ISP",
			"D. ARP,DNS"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149588",
		"题目": "在下列有关DHCP的描述中,不正确的是:",
		"选项": [
			"A. DHCP允许主机自动从服务器获取IP地址",
			"B. DHCP允许地址重复使用",
			"C. DHCP为特定主机指定特定的IP地址",
			"D. DHCP服务器会给出包含配置参数的提议供主机选择"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149589",
		"题目": "DHCP用于主机动态获取_________",
		"选项": [
			"A. IP地址、所在IP网络掩码、缺省路由器IP及MAC地址、DNS服务器IP地址",
			"B. IP地址、所在IP网络号、缺省路由器IP及MAC地址、DNS服务器IP地址",
			"C. IP地址、所在IP网络掩码、缺省路由器IP地址、DNS服务器IP地址",
			"D. IP地址、所在IP网络号、缺省路由器IP地址、DNS服务器IP地址"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149590",
		"题目": "不会产生ICMP差错报文的是_________",
		"选项": [
			"A. 针对ICMP差错报告报文",
			"B. 路由器不能传送数据报",
			"C. 路由器检测到一个异常条件影响它转发数据报",
			"D. 路由器不能正确选择路由"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149591",
		"题目": "ICMP测试的目的是什么?_________",
		"选项": [
			"A. 确定网络是否是跟据模型建立的",
			"B. 确定网络是处于控制模型还是用户模型",
			"C. 保证网络中的所有活动都是受检测的",
			"D. 确定消息是否能够到达目的地,如果不能,则确定可能的原因"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149592",
		"题目": "ping命令就是利用_________协议来测试网络的连通性。",
		"选项": [
			"A. ARP",
			"B. TCP",
			"C. IP",
			"D. ICMP"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149593",
		"题目": "使用ping命令ping另一台主机,就算收到正确的应答,也不能说明_________",
		"选项": [
			"A. 目的主机的ICMP软件和IP软件运行正常",
			"B. ping报文经过的路由器路由选择正常",
			"C. 目的主机可达",
			"D. ping报文经过的网络具有相同的MTU"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149594",
		"题目": "检查网络连通性的应用程序是_________",
		"选项": [
			"A. DNS",
			"B. ARP",
			"C. Ping",
			"D. FTP"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149595",
		"题目": "应用程序Ping发出的是_________报文",
		"选项": [
			"A. TCP请求报文",
			"B. ICMP应答报文",
			"C. TCP应答报文",
			"D. ICMP请求报文"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149596",
		"题目": "基于ICMP的traceroute运行过程中,变化的IP首部字段、数据包目的地分别为_________",
		"选项": [
			"A. Options、沿途路由器;",
			"B. TTL、沿途路由器;",
			"C. Options、主机;",
			"D. TTL、主机"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149597",
		"题目": "以下关于IP多播的描述中,错误的是_________",
		"选项": [
			"A. 利用多播树可以将多播分组转发到整个互联网",
			"B. 发送主机使用多播地址发送分组时不需要了解接收者的位置信息与状态信息",
			"C. IP多播是指多个接收者可以接收到同一个或者一组源节点发送的相同内容的分组",
			"D. 支持多播协议的路由器叫做多播路由器"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149598",
		"题目": "终端主机采用_________协议加入一个IP组播组",
		"选项": [
			"A. RPM",
			"B. DVMRP;",
			"C. ICMP;",
			"D. IGMP;"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149599",
		"题目": "MPLS标签取值有效范围为_________",
		"选项": [
			"A. LSR的一个端口;",
			"B. MPLS域;",
			"C. LSR",
			"D. IP子网;"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149600",
		"题目": "位于归属网络和外地网络之外的源主机,发送数据包给位于外地网络的移动主机过程中,数据包的传输路径(省略常规的转发节点)通常为_________",
		"选项": [
			"A. 源主机、移动主机在归属网络中的缺省路由器、外地代理、移动主机",
			"B. 源主机、归属代理、外地代理、移动主机",
			"C. 源主机、归属代理、移动主机在外地网络中的缺省路由器、移动主机",
			"D. 源主机、外地代理、移动主机"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149601",
		"题目": "以下关于移动IP的描述中,错误的是_________",
		"选项": [
			"A. 目的地址为家乡地址的IP分组,将会以标准的IP路由机制发送到家乡网络",
			"B. 家乡链路与外地链路比家乡网络与外地网络更精确地表示出移动节点接入的位置",
			"C. 家乡代理通过隧道将发送给移动节点的IP分组转发给移动节点",
			"D. 转交地址是指当移动节点接入到一个外地网络时使用的、长期有效的IP地址"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149602",
		"题目": "下面关于网络互连设备叙述错误的是_________",
		"选项": [
			"A. 以太网交换机实质上是一个多端口网桥,工作在网络层",
			"B. 在数据链路层扩展局域网可使用网桥",
			"C. 在物理层扩展局域网可使用转发器和集线器",
			"D. 路由器用来互连不同的网络,是网络层设备"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149603",
		"题目": "下列哪种网络设备能够分隔广播域的是________",
		"选项": [
			"A. 集线器",
			"B. 网关",
			"C. 路由器",
			"D. 交换机"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149604",
		"题目": "能完成VLAN之间数据传递的设备是________",
		"选项": [
			"A. 中继器",
			"B. 集线器",
			"C. 路由器",
			"D. 交换器"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149605",
		"题目": "关于互联网中IP地址,下列叙述不正确的是_________",
		"选项": [
			"A. 当两个路由器直接相连时,在连线两端的接口处,必须指明IP地址",
			"B. 路由器总是具有两个或两个以上的IP地址",
			"C. 用网桥互连的网段仍然是一个局域网,只能有一个网络号",
			"D. 在同一个局域网上的主机或路由器的IP地址中的网络号必须是一样的"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149606",
		"题目": "路由器的功能不包括_________",
		"选项": [
			"A. 流量控制",
			"B. 分组转发",
			"C. 解决异构网络之间的互连问题",
			"D. 路由选择"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149607",
		"题目": "路由器在能够开始向输出链路传输分组的第一个比特之前,必须先接收到整个分组,这种机制被称为_________",
		"选项": [
			"A. 报文交换",
			"B. 存储转发",
			"C. 分组交换",
			"D. 分组检测"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149608",
		"题目": "路由器连接的异构网络指的是_________",
		"选项": [
			"A. 网络中计算机的操作系统不同",
			"B. 数据链路层和物理层均不同",
			"C. 网络的拓扑不同",
			"D. 数据链路层协议相同,物理层协议不同"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149609",
		"题目": "路由器用于连接多个逻辑上分开的网络,工作于_________",
		"选项": [
			"A. 网络层",
			"B. 应用层",
			"C. 网络接口层",
			"D. 传输层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149610",
		"题目": "企业Intranet要与Internet互联,必需的互联设备是_________",
		"选项": [
			"A. 调制解调器",
			"B. 路由器",
			"C. 交换机",
			"D. 中继器"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149611",
		"题目": "以下哪个属于网络层的互连设备_________",
		"选项": [
			"A. 网桥",
			"B. 路由器",
			"C. 集线器",
			"D. 交换机"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149612",
		"题目": "关于路由器,下列说法正确的是_________",
		"选项": [
			"A. 路由器处理的信息量比交换机少,因而转发速度比交换机快",
			"B. 路由器不但可以根据IP地址转发,还可以根据物理地址转发",
			"C. 路由器可以提供网络层的分组转发",
			"D. 对于同一目标,路由器只提供延迟最小的最佳路由"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149613",
		"题目": "将一个局域网连入Internet,首选的设备是_________",
		"选项": [
			"A. 网关",
			"B. 网桥",
			"C. 中继器",
			"D. 路由器"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149614",
		"题目": "两个局域网需要进行互连,互连后的网络应满足:1)安全性。需要对跨越网络的数据流进行过滤,只有满足一定条件的数据包允许通过。2)独立性。两个网络应能独立管理和维护。3)禁止一方的广播报文泛滥到另一方。则互连设备可采用_______。",
		"选项": [
			"A. 中继器",
			"B. 局域网交换机",
			"C. 集线器",
			"D. 路由器"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149615",
		"题目": "路由器涉及TCP/IP网络架构的_______层。",
		"选项": [
			"A. 传输层",
			"B. 网络接口层",
			"C. 网络接口层和网络层",
			"D. 网络层"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149621",
		"题目": "下列哪种说法是错误的?_________",
		"选项": [
			"A. IP层可以为用户提供通用的服务",
			"B. IP层可以代替各个物理网络的数据链路层工作",
			"C. IP层可以屏蔽各个物理网络的差异",
			"D. IP层可以隐藏各个物理网络的实现细节"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149622",
		"题目": "一般情况下,ICMP是通过_________发送差错和控制报文。",
		"选项": [
			"A. 网卡",
			"B. 交换机",
			"C. 网桥",
			"D. 路由器"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149623",
		"题目": "路由器不提供哪个功能?_________",
		"选项": [
			"A. 协议转换",
			"B. 数据封装",
			"C. 差错控制和流量控制",
			"D. 数据分段"
		],
		"我的答案": " C",
		"标准答案": " C"
	}
]