questions[questions.length] = [
	{
		"ID": "question403149333",
		"题目": "计算机网络可以视为是_________和_________的合成。",
		"选项": [
			"A. 计算机技术与多媒体技术",
			"B. 数字技术与模拟技术",
			"C. 计算机技术与通信技术",
			"D. 电子技术与通信技术"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149334",
		"题目": "下列不属于计算机网络定义中的关键词是_________",
		"选项": [
			"A. 资源共享",
			"B. 自治计算机",
			"C. 相互连接",
			"D. 分组交换"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149335",
		"题目": "计算机网络最重要的功能是_________",
		"选项": [
			"A. 提高计算机的可靠性和可用性",
			"B. 通过网络连接主机实现资源共享",
			"C. 实现计算机技术与通信技术的结合",
			"D. 实现可靠数据通信"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149336",
		"题目": "计算机网络中可以共享的资源包括_________",
		"选项": [
			"A. 主机、外设、软件",
			"B. 主机、程序、数据",
			"C. 硬件、程序、数据",
			"D. 硬件、软件、数据"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149337",
		"题目": "不属于计算机网络组成部分的是_________",
		"选项": [
			"A. 节点",
			"B. 通信线路",
			"C. 主机",
			"D. 电话机"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149338",
		"题目": "下列对计算机网络描述正确的是_________",
		"选项": [
			"A. 执行计算机数据处理的软件",
			"B. 多个处理器通过共享内存实现的紧耦合系统",
			"C. 用于共同完成某一任务的分布式系统",
			"D. 由自治的计算机互联起来的集合"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149339",
		"题目": "常见的网络拓扑不包括_________",
		"选项": [
			"A. 网状结构",
			"B. 总线结构",
			"C. 环形结构",
			"D. 层次结构"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149617",
		"题目": "网络拓扑结构中,若每一个结点和网中其他任何结点均有链路连接,该拓扑结构为_________",
		"选项": [
			"A. 树形结构",
			"B. 星形结构",
			"C. 网状结构",
			"D. 环形结构"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149340",
		"题目": "分布式网络最主要的特点是_________",
		"选项": [
			"A. 网状网络无中心节点",
			"B. 网络地理范围大",
			"C. 网络用户多",
			"D. 网络带宽大"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149341",
		"题目": "公用电话交换网中的交换设备提供_________交换方式。",
		"选项": [
			"A. 分组",
			"B. 信元",
			"C. 报文",
			"D. 电路"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149342",
		"题目": "世界上第一个投入运行的分组交换网是_________",
		"选项": [
			"A. Ethernet",
			"B. Internet",
			"C. ARPANET",
			"D. NSFNet"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149343",
		"题目": "现有的公共数据网主要采用的技术是_________",
		"选项": [
			"A. 电路交换",
			"B. 分组交换",
			"C. 语音插空",
			"D. 报文交换"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149344",
		"题目": "关于数据交换技术,以下那一种说法是正确的?_________",
		"选项": [
			"A. 交换技术适用于任何一种拓扑结构的计算机网络",
			"B.\n\n采用数据报方式的分组交换中，每个分组中都必须包含目的站点的地址\n\n\n",
			"C. 分组交换的优点在于目的站点不需要对报文进行重新组装",
			"D. 分组交换中,每个分组的长度都是相同的"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149345",
		"题目": "与电路交换相比,分组交换的缺点不包括哪些?_________",
		"选项": [
			"A. 时延可能波动",
			"B. 连接数量有限",
			"C. 不能保证传输性能",
			"D. 有可能存在拥塞"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149346",
		"题目": "下列关于电路交换方式的描述,正确的是_________",
		"选项": [
			"A. 电路交换方式比分组交换方式相比,通信效率总是偏低",
			"B. 电路交换方式传输的数据不需要额外的协议开销",
			"C. 电路交换方式的优点是系统效率高、适用于突发性通信",
			"D. 电路交换方式通信缺点是实时性弱,不适用于交互式会话类通信"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149347",
		"题目": "电路交换最适用的场景是:_________",
		"选项": [
			"A. 存储转发",
			"B. 实时和交互式通信",
			"C. 传输信息量较小",
			"D. 不可靠的信息传输"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149348",
		"题目": "计算机网络的存储转发技术包括_________",
		"选项": [
			"A. 报文交换、数据交换",
			"B. 报文交换、分组交换",
			"C. 电路交换、分组交换",
			"D. 报文交换、帧交换"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149349",
		"题目": "下列说法不正确的是_________",
		"选项": [
			"A. 电路交换一定是面向连接的",
			"B. 电路交换传输的协议数据单元一定不需要携带完整的地址",
			"C. 分组交换一定是无连接的",
			"D. 分组交换传输的协议数据单元不一定需要携带完整的地址"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149350",
		"题目": "在数据传输的线路复用技术中,时分复用与统计时分复用的区别是_________",
		"选项": [
			"A. 时分复用采用时间片控制,统计时分复用不采用时间片控制",
			"B. 时分复用采用固定时间片控制,统计时分复用采用按需分配时间片控制",
			"C. 时分复用采用预先扫描用户需求控制,统计时分复用不预先扫描用户需求控制",
			"D. 时分复用与统计时分复用在信道复用控制策略上基本相同"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149351",
		"题目": "计算机网络按照网络规模大小可以分为_________",
		"选项": [
			"A. 移动计算机网络、固定计算机网络",
			"B. 个域网、局域网、城域网、广域网",
			"C. 专用网络、公共网络",
			"D. 接入网、承载网、骨干网"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149352",
		"题目": "哪一组网络分类方法有误?_________",
		"选项": [
			"A. 对等网/城域网",
			"B. 局域网/广域网",
			"C. 有线网/无线网",
			"D. 环型网/星型网"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149353",
		"题目": "局域网的英文缩写为_________",
		"选项": [
			"A. LAN",
			"B. WAN",
			"C. MAN",
			"D. SAN"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149354",
		"题目": "计算机网络从逻辑功能上可分为_________",
		"选项": [
			"A. 局域网和广域网",
			"B. 有线网络和无线网络",
			"C. 资源子网和通信子网",
			"D. 服务器和客户机"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149355",
		"题目": "一层宿舍楼的计算机网络系统通常属于_________",
		"选项": [
			"A. LAN",
			"B. WAN",
			"C. MAN",
			"D. PAN"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149356",
		"题目": "连接武汉三镇的计算机网络系统通常属于_________",
		"选项": [
			"A. PAN",
			"B. LAN",
			"C. WAN",
			"D. MAN"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149357",
		"题目": "下面关于客户和服务器的描述错误的是_________",
		"选项": [
			"A. 客户/服务器方式描述的是进程之间服务与被服务的关系",
			"B. 客户和服务器是指通信中所涉及的两个应用进程",
			"C. 一个客户程序可与多个服务器进行通信",
			"D. 服务器是服务请求方,客户是服务提供方"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149358",
		"题目": "计算机网络通信的一个显著特点是_________",
		"选项": [
			"A. 稳定性",
			"B. 流量间歇性、突发性",
			"C. 易用性",
			"D. 安全性"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149359",
		"题目": "关于计算机网络及其结构模型,下列说法错误的是_________",
		"选项": [
			"A. ARPAnet是最早验证分组交换的网络之一",
			"B. Internet起源于ARPAnet",
			"C. OSI参考模型是计算机网络的事实标准",
			"D. TCP/IP协议族早期设计时并未按照严格分层的原则"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149360",
		"题目": "为进行网络中的数据交换而建立的规则、标准或约定称为_________",
		"选项": [
			"A. 文件",
			"B. 协议",
			"C. RFC文档",
			"D. 因特网"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149361",
		"题目": "关于网络协议和网络体系结构,说法正确的包括_________",
		"选项": [
			"A. 协议接口主要是指对等实体之间的通信接口",
			"B. 计算机网络必须采用分层架构来进行组织",
			"C. 计算机网络的分层可以有助于各层的独立设计",
			"D. 协议要素包括语义、语法、词汇。"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149362",
		"题目": "两个对等实体之间通信所需遵从的特定规则称为_________",
		"选项": [
			"A. 语法规范",
			"B. 同步",
			"C. 端到端的协议",
			"D. 协议"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149363",
		"题目": "协议的基本要素包括_________",
		"选项": [
			"A. 语法、地址、次序",
			"B. 实体、文件、规则",
			"C. 语法、语义、时序",
			"D. 实体、规则、时序"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149364",
		"题目": "协议的要素不包括_________",
		"选项": [
			"A. 语法",
			"B. 同步",
			"C. 语义",
			"D. 速率"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149365",
		"题目": "两个或多个网络对等实体之间通信所需遵从的特定规则称做_________",
		"选项": [
			"A. 协议",
			"B. 语法规范",
			"C. 端到端的通信规程",
			"D. 同步技术"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149366",
		"题目": "对等实体的定义,正确的是_________",
		"选项": [
			"A. 同一系统中,处于相同层的两个实体",
			"B. 同一系统中,处于不同层的两个实体",
			"C. 不同系统中,处于不同层的两个实体",
			"D. 不同系统中,处于相同层的两个实体"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149367",
		"题目": "构成网络系统各个层次的抽象对象称做_________",
		"选项": [
			"A. 服务访问点",
			"B. 协议",
			"C. 体系结构",
			"D. 实体"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149368",
		"题目": "网络协议主要要素包括_________",
		"选项": [
			"A. 数据格式、控制信息、速度匹配",
			"B. 编码、控制信息、时序",
			"C. 语法、语义、时序",
			"D. 数据格式、编码、信号电平"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149369",
		"题目": "同一系统相邻两层之间的交互接口，称为_________",
		"选项": [
			"A. 网卡",
			"B. 自治系统",
			"C. 协议栈",
			"D. 服务访问点"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149370",
		"题目": "在封装过程中,加入的地址信息是指_________",
		"选项": [
			"A. 网络服务访问点",
			"B. IP地址",
			"C. 物理地址",
			"D. 根据具体协议而定"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149371",
		"题目": "以下关于网络体系结构概念的描述中错误的是_________",
		"选项": [
			"A. 网络体系结构是抽象的,而实现网络协议的技术是具体",
			"B. 所有的计算机网络都必须遵循OSI体系结构",
			"C. 网络体系结构是网络层次结构模型与各层协议的集合",
			"D. 网络体系结构对计算机网络应该实现的功能进行定义"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149372",
		"题目": "下列选项中,不属于网络体系结构所描述的内容是_________",
		"选项": [
			"A. 每一层必须完成的功能",
			"B. 网络的层次",
			"C. 协议的内部实现细节",
			"D. 每一层使用的协议"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149373",
		"题目": "服务与协议是完全不同的两个概念,下列关于它们的说法错误的是_________",
		"选项": [
			"A. 协议是水平的,即协议是控制对等实体间通信的规则。服务是垂直的,即服务是下层向上层通过层间接口提供的",
			"B. 在协议的控制下,两个对等实体间的通信使得本层能够向上一层提供服务。",
			"C. 协议的实现保证了能够向上一层提供服务,要实现本层协议,还需要使用下面一层所提供的服务",
			"D. 协议规定了层与层之间的信息交换的数据单元"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149374",
		"题目": "关于计算机网络架构的分层,不正确的包括_________",
		"选项": [
			"A. 每一层都实现一种相对独立的功能,降低大系统的复杂度。",
			"B. 各层的定义主要在功能方面,不应指定具体的实现方法。",
			"C. 下层对上层相对独立,下层调用上层提供的服务",
			"D. 各层之间界面清晰,交互接口尽可能简单。"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149375",
		"题目": "计算机网络体系采用层次结构,其优势不包括_________",
		"选项": [
			"A. 层次结构允许每一层只能同相邻的上下层次发生联系,便于工程设计的协作与分工",
			"B. 使各层次的功能相对独立,使得各层次实现技术的进步不影响相邻层次,从而保持体系结构的稳定性",
			"C. 层次结构的方法可以简化计算机网络的实现",
			"D. 层次结构是使用最广泛的模块化结构"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149376",
		"题目": "在OSI参考模型中,第N层与第N+1层之间的关系是_________",
		"选项": [
			"A. 第N层与第N+1层没有直接关系",
			"B. 第N+1层从第N层接收报文并添加报头",
			"C. 第N层使用第N+1层提供的服务",
			"D. 第N层是第N+1层的服务提供者"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149377",
		"题目": "在分层网络模型中,第N层提供的服务是_________与对等层实体交换信息来实现的。",
		"选项": [
			"A. 利用第N层提供的服务以及按N+1层协议",
			"B. 利用第N层提供的服务以及按N-1层协议",
			"C. 利用N+1层提供的服务以及按N层协议",
			"D. 利用N-1层提供的服务以及按N层协议"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149378",
		"题目": "下列说法不正确的是_________",
		"选项": [
			"A. 第N层的协议的运行要以第N-1层向第N层提供服务为基础",
			"B. 第N层的实体是第N层的服务用户",
			"C. 第N-1层向第N层提供服务是以第N-1层协议的运行为基础",
			"D. 第N-1层实体是第N层实体的服务提供者"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149379",
		"题目": "在OSI参考模型中,物理层的功能是_________",
		"选项": [
			"A. 建立和释放连接",
			"B. 透明地传输原始比特流",
			"C. 在物理实体间传送数据帧",
			"D. 发送和接受用户数据"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149380",
		"题目": "在OSI参考模型中,自下而上第一个提供端到端服务的层次是_________",
		"选项": [
			"A. 数据链路层",
			"B. 传输层",
			"C. 网络层",
			"D. 物理层"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149381",
		"题目": "在OSI参考模型中,为数据分组提供路由功能的是_________",
		"选项": [
			"A. 数据链路层",
			"B. 传输层",
			"C. 网络层",
			"D. 物理层"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149382",
		"题目": "在OSI参考模型中,直接为会话层提供服务的是_________",
		"选项": [
			"A. 传输层",
			"B. 表示层",
			"C. 网络层",
			"D. 应用层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149383",
		"题目": "在OSI参考模型中,下列功能需由应用层的相邻层实现的是_________",
		"选项": [
			"A. 路由选择",
			"B. 数据格式转换",
			"C. 可靠数据传输",
			"D. 对话管理"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149384",
		"题目": "数据被分割成帧是在OSI协议中的_________",
		"选项": [
			"A. 网络层",
			"B. 传输层",
			"C. 物理层",
			"D. 数据链路层"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149385",
		"题目": "关于OSI参考模型,以下陈述正确的是_________",
		"选项": [
			"A. 真正传输的数据很大,而控制头小",
			"B. 数据总是由物理层传输到应用层",
			"C. 每层之间相互直接通讯",
			"D. 物理层确保数据可在物理媒体上传输"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149386",
		"题目": "在OSI参考模型中,提供建立、维护和拆除端到端连接功能的是_________",
		"选项": [
			"A. 传输层",
			"B. 数据链路层",
			"C. 物理层",
			"D. 网络层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149387",
		"题目": "OSI参考模型中,哪个层次用来在设备的进程间传递报文?_________",
		"选项": [
			"A. 网络层",
			"B. 会话层",
			"C. 传输层",
			"D. 表示层"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149388",
		"题目": "在分层网络模型中,控制相邻两个结点间通信流量的工作应安排在_________",
		"选项": [
			"A. 网络层",
			"B. 传输层",
			"C. 数据链路层",
			"D. 物理层"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149389",
		"题目": "控制计算机网络端到端流量的工作应安排在_________",
		"选项": [
			"A. 传输层",
			"B. 数据链路层",
			"C. 物理层",
			"D. 网络层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149390",
		"题目": "_________会将原始的比特流断界成分离的单元,并且遵循协议交换这些单元。",
		"选项": [
			"A. 数据链路层",
			"B. 传输层",
			"C. 物理层",
			"D. 网络层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149391",
		"题目": "决定使用哪条途径通过网络,应属于下列OSI的哪一层处理?_________",
		"选项": [
			"A. 传输层",
			"B. 数据链路层",
			"C. 物理层",
			"D. 网络层"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149392",
		"题目": "局域网与OSI模型相对应的层次有_________",
		"选项": [
			"A. 物理层、数据链路层",
			"B. 物理层",
			"C. 数据链路层",
			"D. 数据链路层、网络层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149393",
		"题目": "Internet架构（TCP/IP协议族）共分_________",
		"选项": [
			"A. 7层",
			"B. 6层",
			"C. 4层",
			"D. 5层"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149394",
		"题目": "关于TCP/IP协议族与OSI模型关系的论述,正确的是________",
		"选项": [
			"A. TCP/IP网络接口层对应OSI模型中的网络层",
			"B. TCP/IP 网络接口层对应OSI模型中的物理层",
			"C. TCP/IP应用层汇集了OSI模型中的会话层,表示层和应用层",
			"D. TCP/IP的传输层包含OSI模型中的传输层和数据链路层"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149395",
		"题目": "TCP/IP协议族中的TCP和IP所提供的服务分别为_________",
		"选项": [
			"A. 链路层服务和网络层服务",
			"B. 传输层服务和应用层服务",
			"C. 传输层服务和网络层服务",
			"D. 网络层服务和传输层服务"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149396",
		"题目": "报文段(Segment)的概念是在_________层用到的",
		"选项": [
			"A. 物理层",
			"B. 网络层",
			"C. 数据链路层",
			"D. 传输层"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149397",
		"题目": "物理层、数据链路层、网络层传送的数据单位分别为_________",
		"选项": [
			"A. 比特、分组、帧",
			"B. 比特、帧、分组",
			"C. 帧、分组、比特",
			"D. 分组、比特、帧"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149398",
		"题目": "以下哪类设备涉及OSI模型层次最多?_________",
		"选项": [
			"A. 路由器",
			"B. 网桥",
			"C. 集线器",
			"D. 网关"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149399",
		"题目": "以下哪类设备涉及OSI模型层次最少?_________",
		"选项": [
			"A. 集线器",
			"B. 网关",
			"C. 网桥",
			"D. 路由器"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149400",
		"题目": "节点发送数据时,数据块从节点进入到传输媒体所需要的时间为_________",
		"选项": [
			"A. 链路长度与信号在链路上的传播速率之比",
			"B. 数据块长度与链路带宽之比",
			"C. 传播时延",
			"D. 链路带宽"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149401",
		"题目": "下列哪个词与其他词不同义?_________",
		"选项": [
			"A. 传播时延",
			"B. 传送时延",
			"C. 传输时延",
			"D. 发送时延"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149402",
		"题目": "_________表示单位时间内成功地传送数据的数量",
		"选项": [
			"A. 发送速率",
			"B. 宽带",
			"C. 带宽",
			"D. 吞吐量"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149403",
		"题目": "以下关于带宽的描述中,错误的是_________",
		"选项": [
			"A. 链路的带宽是指链路上每秒所能传送的比特数",
			"B. 在单位时间内通过网络中某一点的最高数据率,常用的单位为bps。",
			"C. 网络设备的总带宽等于网络设备各端口带宽之和",
			"D. 链路的带宽往往大于链路的吞吐量。"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149404",
		"题目": "链路的带宽是指_________",
		"选项": [
			"A. 在单位时间内,链路能传输的数据量",
			"B. 信号在通信介质中的传播速率。",
			"C. 信噪比的大小",
			"D. 同一时刻能传送的二进制比特数"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149405",
		"题目": "以下关于链路吞吐量的描述中,错误的是_________",
		"选项": [
			"A. 链路吞吐量为单位时间内成功地传送数据的数量",
			"B. 一段链路由两端结点以及结点之间的通信线路组成,链路吞吐量取值为三者的最小值",
			"C. 受各种低效率因素的影响,由带宽为10Mbps的链路连接的一对节点可能只达到2Mbps的吞吐量",
			"D. 链路吞吐量的大小等于链路的带宽"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149406",
		"题目": "关于网络设备(如交换机)的吞吐量,描述不正确的是_________",
		"选项": [
			"A. 吞吐量的大小主要由网络设备的输入输出端口硬件,以及程序算法的效率决定",
			"B. 没有帧丢失时,设备能够接收并转发的最大数据速率",
			"C. 吞吐量是指链路上每秒所能传送的比特数",
			"D. 单位时间内,网络设备各端口存储转发的比特数之和"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149407",
		"题目": "分组从网络的一端传送到另一端所需的时间叫时延,网络中时延组成不包括_________",
		"选项": [
			"A. 排队时延",
			"B. 传播时延",
			"C. 运算时延",
			"D. 发送时延"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149408",
		"题目": "提高链路带宽,可以减少数据的_________",
		"选项": [
			"A. 等待时延",
			"B. 排队时延",
			"C. 传播时延",
			"D. 发送时延"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149409",
		"题目": "交换节点为存储转发而进行一些处理所花费的时间,就是_________",
		"选项": [
			"A. 排队时延",
			"B. 传播时延",
			"C. 处理时延",
			"D. 发送时延"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149410",
		"题目": "计算机网络通信过程中的各种时延中,与数据大小无关的是_________",
		"选项": [
			"A. 排队时延",
			"B. 传输时延",
			"C. 传播时延",
			"D. 处理时延"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149411",
		"题目": "网络中常见的时延,不包括_________",
		"选项": [
			"A. 发送时延",
			"B. 传播时延",
			"C. 接收时延",
			"D. 处理时延"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149412",
		"题目": "计算机网络中的性能指标,不包括_________",
		"选项": [
			"A. 时延抖动",
			"B. 跳数",
			"C. 时延",
			"D. 带宽"
		],
		"我的答案": " B",
		"标准答案": " B"
	},
	{
		"ID": "question403149413",
		"题目": "时延带宽积的物理意义表示_________",
		"选项": [
			"A. 网络容纳比特的能力",
			"B. 网络传送比特的能力",
			"C. 网络传播比特的能力",
			"D. 网络传输比特的能力"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149616",
		"题目": "根据计算机网络的定义,其主要特征不包括_________",
		"选项": [
			"A. 互联的计算机系统是自治的系统",
			"B. 支持持续通信的流量",
			"C. 支持计算机资源的共享",
			"D. 联网的计算机系统之间需要遵循共同的网络协议"
		],
		"我的答案": " B",
		"标准答案": " B"
	}
]