questions[questions.length] = [
	{
		"ID": "question403149651",
		"题目": "以下有关UDP的描述中,不正确的是_________",
		"选项": [
			"A. 相对于IP数据报服务,UDP在IP之上只增加了端口的功能和差错检测功能",
			"B. UDP用户数据报只能提供不可靠的交付",
			"C. 发送数据之前不需要建立连接",
			"D. 网络出现拥塞时,会使源主机的发送速率降低"
		],
		"我的答案": " D",
		"标准答案": " D"
	},
	{
		"ID": "question403149652",
		"题目": "以下有关端口的描述中,不正确的是_________",
		"选项": [
			"A. 端口号只具有本地意义,在因特网中不同计算机的相同端口号是没有联系的。",
			"B. 套接字由IP地址和端口号组成",
			"C. 端口的作用只是让各个应用进程都能将其数据通过端口向下交付给运输层",
			"D. 端口就是运输层服务访问点"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149653",
		"题目": "在TCP/IP协议族中,UDP协议工作在_________",
		"选项": [
			"A. 传输层",
			"B. 应用层",
			"C. 网络接口层",
			"D. 网络互联层"
		],
		"我的答案": " A",
		"标准答案": " A"
	},
	{
		"ID": "question403149654",
		"题目": "为解决UDP报文的可靠传输问题,可以_________。",
		"选项": [
			"A. 合理使用IP协议",
			"B. 合理使用TCP协议",
			"C. 合理设计应用层协议",
			"D. 无需做任何事情"
		],
		"我的答案": " C",
		"标准答案": " C"
	},
	{
		"ID": "question403149655",
		"题目": "下列关于UDP的描述,正确的是_________。",
		"选项": [
			"A. 给出数据的按序投递",
			"B. 不允许多路复用",
			"C. 是无连接的",
			"D. 拥有流量控制机制"
		],
		"我的答案": " C",
		"标准答案": " C"
	}
]